[{"conferenceId":"cc-20180517","fromTime":"2018-05-17 09:00","id":"cc-46t4siorbg7iini1e1s2l7ldfh","kind":"keynote","speakers":[],"title":"Breakfast","toTime":"2018-05-17 09:25","type":"keynote"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 09:25","id":"cc-6rpcth4pfquh16nrdjk1vmm8pj","room":"Salle A","speakers":[{"id":"gbianchi29e7fb7fbb42479a8988ee113e98dfc4","name":"Giulia Bianchi"}],"title":" 🇬🇧 Opening","toTime":"2018-05-17 09:30","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 09:25","id":"cc-70iat11ud5193kb5j0jhk1n0ma","room":"Salle B","speakers":[{"id":"ldivadd9ff21aa246c4d6abaaf41f8e1899190","name":"Loic Divad"}],"title":"🇫🇷 Opening","toTime":"2018-05-17 09:30","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 09:30","id":"cc-70o9llt03pcsnb2ltbdqdqk36l","room":"Salle B","speakers":[{"id":"obergeretb04e1885ce374f778690d68ba3bb32af","name":"Olivier Bergeret"}],"summary":"**Pitch**\n\nBuild, train, and deploy machine learning models at scale\nMachine learning often feels a lot harder than it should be to most developers because the process to build and train models, and then deploy them into production is too complicated and too slow.\n\nAmazon SageMaker includes modules that can be used together or independently to build, train, and deploy your machine learning models.","title":"🇫🇷 Machine learning models at scale with Amazon SageMaker - AWS","toTime":"2018-05-17 10:15","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 09:30","id":"cc-7cn03hsmhms7efn8p07kmv78ve","room":"Salle A","speakers":[{"id":"knelsona25d85fedfea435b9fdf64565f713adf","name":"Kevin Nelson"}],"summary":"**Pitch**\n\nThanks to machine learning and AI, applications are now being created that can see, hear, and understand the world around them. Learn how you can easily infuse AI into your business today. In addition to a guided walkthrough of easy-to-use machine learning APIs from Google Cloud: Cloud Vision, Cloud Video Intelligence, Cloud Speech, Cloud Natural Language, and Cloud Translation, we'll demonstrate how Google Cloud AutoML enables developers with limited machine learning expertise to train high quality models by leveraging Google’s state of the art transfer learning, and Neural Architecture Search technology.","title":"🇬🇧 A crash course on Google Cloud AutoML and machine learning APIs - GOOGLE","toTime":"2018-05-17 10:15","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 10:25","id":"cc-1mkr3ol359bfqb2m2673q20i2m","room":"Salle A","speakers":[{"id":"framire2f9eb25246ba4937b3e18bd42f761a91","name":"Florent Ramière"}],"summary":"**Pitch**\n\nThe Kafka ecosystem goes way beyond the brokers: Kafka Connect, Kafka Stream and KSQL are amazing tools!\nI propose to walk you through the implementation of all these components with a focus on streaming and monitoring.\nCome Join me to learn how to leverage Kafka to put your data in motion!","title":"🇫🇷 Kafka beyond the brokers: Stream processing and Monitoring - CONFLUENT","toTime":"2018-05-17 11:10","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 10:25","id":"cc-4sstl8ouc5vm0a9i6dluf45rnn","room":"Salle B","speakers":[{"id":"collionf8da7477168a401e8256bf26c88e54fe","name":"Charles Ollion"}],"summary":"**Pitch**\n\nBeyond the AI hype, significant new possibilities in the world of computer vision have arisen in the last few years. However, deploying computer vision solutions still requires expert vision knowledge, business understanding, solid engineering and smart processes. I’ll expose the challenges of computer vision applied to a vertical domain such as fashion, and how we solved them at Heuritech.","title":"🇬🇧 Deep learning for vision into the wild - HEURITECH","toTime":"2018-05-17 10:45","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 10:50","id":"cc-3cibtn2eokm44rqukqqpuav4c7","room":"Salle B","speakers":[{"id":"apeleteiroramallo321aed5b480042b29e7929f319271611","name":"Ana Peleteiro Ramallo"}],"summary":"**Pitch**\n\nIn recent years, deep learning (DL) has proven to be a transformative force that has made impressive advances in different fields. In fact, within the area of natural language processing (NLP), deep learning has outperformed many former state of the art approaches, such as in machine translation or named entity recognition (NER). In this talk I will present various deep learning algorithms and architectures for NLP, with examples of how they can be leveraged to real world applications.","title":"🇬🇧 The wonders of deep learning: how to leverage it for natural language processing - TENDAM","toTime":"2018-05-17 11:10","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 11:10","id":"cc-3d8mpes5hvet7km7uu97bv2im5","kind":"keynote","speakers":[],"title":"Break","toTime":"2018-05-17 11:35","type":"keynote"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 11:35","id":"cc-2n16048n9lub6ea5laruve3col","room":"Salle B","speakers":[{"id":"slequeuxac1fa63d7b82452498644a495d411419","name":"Sylvain Lequeux"}],"summary":"**Pitch**\n\nOut of curiosity, ask the other people in the conference room who has already developped neural networks: you will see a lot of hands up. Then ask them how many of those models run in production: epic fail.\n\nCome and see a solution to train and deploy TensorFlow models in the cloud using Google CloudML.","title":"🇫🇷 Tensors in the sky with CloudML - XEBIA","toTime":"2018-05-17 12:20","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 11:35","id":"cc-572jj0hjvsq1d0b32e4gg2be6j","room":"Salle A","speakers":[{"id":"pvillard55337e8a3e554bbca1a24c10871b5534","name":"Pierre Villard"}],"summary":"**Pitch**\n\nApache NiFi provides a revolutionary data flow management system with a broad range of integrations with existing data production, consumption, and analysis ecosystems, with robust data delivery and provenance infrastructure. This talk will mainly focus on how to deal with workflows lifecycle.","title":"🇬🇧 How to deal with workflows lifecycle in Apache NiFi? - HORTONWORKS","toTime":"2018-05-17 12:20","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 12:30","id":"cc-26pru6p7mes3bn0llkq0uq5ud7","room":"Salle B","speakers":[{"id":"mblancde84ea9a64244210a05312ff078fcfd5","name":"Matthieu Blanc"}],"summary":"\n**Pitch**\n\n\nData lineage is defined as a data life cycle that includes the data’s origin sand where it moves over time. It has become a crucial component of any data centric company, whether for documentation, regulatory compliance, data quality or business impact assessment. This talk will offer an overview of the different approaches to construct and visualize metadata and data lineage in a Big Data environment.","title":"🇫🇷 Data lineage: visualize the data life cycle - ZEENEA","toTime":"2018-05-17 12:50","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 12:30","id":"cc-3jbli2h3cg39495s602os05913","room":"Salle A","speakers":[{"id":"amorvan9c5064f1ccf34e87a98f4ac99328fb7c","name":"Adrien Morvan"},{"id":"copreanc65647af46d34fb8a0497c7bb18a59ad","name":"Cristina Oprean"}],"summary":"\n**Pitch**\n\nPhotobox business is about pictures and derived products: we process 2 to 6 millions photos on a daily basis. To suggest adapted products to our customers we need to handle and better understand the content of their pictures.\n\nSince the number of personal photos has greatly increased thanks to the development of digital cameras and smartphones, scalability is a must.\nThe goal of this presentation is to introduce our large scale automatic photo labelling pipeline.","title":"🇫🇷 Transforming pictures into memories - PHOTOBOX","toTime":"2018-05-17 12:50","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 12:50","id":"cc-35snpe8o6i7djkgcro7kb2mh74","kind":"keynote","speakers":[],"title":"Lunch Break","toTime":"2018-05-17 14:00","type":"keynote"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 14:00","id":"cc-3lb7gkj213ekb5re7h5l3c7jbb","room":"Salle A","speakers":[{"id":"aguggiola47ee57b6372343dd9cd62fb7137af4f4","name":"Alberto Guggiola"},{"id":"angree9950d8ce2614d25905b2e96f1611210","name":"Aurélia Nègre"}],"summary":"**Pitch**\n\nEver been stuck in a data science use case where any approach seems too hard? Graph theory, describing a system just in terms of nodes and links, could be your answer! In the practical example we’ll show, we’ll try to find data science communities and their leaders in LinkedIn. Challenge accepted?","title":"🇬🇧 Exploring graphs: looking for communities & leaders - QUANTMETRY","toTime":"2018-05-17 14:45","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 14:00","id":"cc-5ur01agmoanhcjocs63hilprbp","room":"Salle B","speakers":[{"id":"pballereaud1f14262bec5489b839e7a964b1002bf","name":"Pauline Ballereau"},{"id":"nlaille803ee1452ad5431a8559de2fe498e65a","name":"Nicolas Laille"}],"summary":"**Pitch**\n\nJoin the journey of a Data Scientist on the way to industrialization... From notebook to poc, from poc to production, we will cover what happened at Air France. It won’t be golden rules, but a true story. \nWhat is exactly industrializing Data Science ? How to package Data Science models ? How to articulate Data Scientists and Data Engineers roles ? Is continuous integration a wild dream for Data Scientists ? \nThis journey will feed you with key concepts which worked at Air France, and might give you a new light to guide you through your own Data Science journey.","title":"🇫🇷 A data scientist journey to industrialization of machine learning - AIR FRANCE","toTime":"2018-05-17 14:45","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 14:55","id":"cc-5chi46c7m5brkih6tfbf6lnqf9","room":"Salle B","speakers":[{"id":"sghalloussidb864d685e17454d924107ae20f385d7","name":"Samah Ghalloussi"}],"summary":"**Pitch**\n\nI tested several platforms for creating chatbots with the objective of simulating a patient coming to the emergency room so that medical students could ask questions to establish a diagnosis.\n\nThe major advances in the field of Natural Language Processing and Artificial Intelligence have seen the emergence of chatbot platforms to develop your own agent from a web service.\n\nI will present 4 platforms from major technology companies offering their service in French.","title":"🇫🇷 Enhancing medical student practice with patient-like chatbots - MINISTÈRE DES SOLIDARITÉS ET DE LA SANTÉ","toTime":"2018-05-17 15:15","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 14:55","id":"cc-71urr0jdr72gip14vjji285m4e","room":"Salle A","speakers":[{"id":"jlaskowskieebdcd379e384731aafba6c09399d8f7","name":"Jacek  Laskowski"}],"summary":"\n**Pitch**\n\nIf you want to get even slightly better performance of your structured queries (regardless whether they are batch or streaming) you have to peek at the foundations of Dataset API starting with QueryExecution. That's where any query ends up at and my talk starts. The talk will show you what stages a structured query has to go through before execution in Spark SQL. I'll be talking about the different phases of query execution and the logical and physical optimizations. In the end, I'll do a live coding session to show the steps to write logical and physical optimizations in Scala.","title":"🇬🇧 The internals of query execution in Spark SQL","toTime":"2018-05-17 15:40","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 15:20","id":"cc-6sa305e2qq30hdiajvmj69d3ub","room":"Salle B","speakers":[{"id":"psendorek4279542fbe4f4931ae99c14e4f18e4a0","name":"Pierre Sendorek"},{"id":"plopezf84297d6061449a982d1ed9e4205ea93","name":"Pablo Lopez"}],"summary":"**Pitch**\n\nDuring DataXDay, you'll hear a lot about machine learning and deep learning. But sometimes, combining those advanced techniques with a more \"traditional\" approach can enhance results in a spectacular way. See how, a data scientist and a software engineer, we managed to build an identity card recognition API.","title":"🇫🇷 From users photography to valuable information : how to decipher an identity card through deep learning - XEBIA","toTime":"2018-05-17 15:40","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 15:40","id":"cc-5muuo5u0i6gmko4vmghgch2oae","kind":"keynote","speakers":[],"title":"Break","toTime":"2018-05-17 16:05","type":"keynote"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 16:05","id":"cc-1d574c9k29b1mlqd2gpjn1i6ri","room":"Salle A","speakers":[{"id":"sfriquetf17431a61942416c94c5620d6141bf1f","name":"Sylvain Friquet"}],"summary":"**Pitch**\n\nThis talk will cover how we redesigned our analytics API from the ground up to serve metrics in near real time from billions of events per day. We'll go through the tools we considered for the job to how we actually implemented our solution, starting from the datastore up to the whole data pipeline and its API, leveraging Golang, Kubernetes, GCP and Citus.","title":"🇬🇧 Building a Real Time Analytics API at Scale - ALGOLIA","toTime":"2018-05-17 16:50","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 16:05","id":"cc-206pnr9v6dlfe7jeitb04mn481","room":"Salle B","speakers":[{"id":"vponcet4e7aaea9824c4adeafc51172c474db3d","name":"Vincent Poncet"}],"summary":"\n**Pitch**\n\nMillions of people, objects and ‘things’ connecting with each other is changing the way organisations and consumers interact with each other and the environment around them. Data comes from different geographical locations and across multiple channels. Managing this explosion of high velocity dynamic data while maintaining customer privacy is a challenge with legacy systems.","title":"🇫🇷 How to get real-time value from your IoT data? - DATASTAX","toTime":"2018-05-17 16:50","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 17:00","id":"cc-2ootg3mc2t32rjtdscrd4qifii","room":"Salle A","speakers":[{"id":"tlamiraultec83871063844ee691b50d746b919f14","name":"Thomas Lamirault"}],"summary":"**Pitch**\n\n\nAt BlaBlaCar we have built a streaming platform to have fast insights about the usage of our services. I will show you how BlaBlaCar builds an automatic access log streaming analysis to improve the security and gain fine-grained knowledge of the platform usage.","title":"🇫🇷 Real-Time Access log analysis - BLABLACAR","toTime":"2018-05-17 17:20","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 17:00","id":"cc-4dlascnbknntt61k8idvra4e01","room":"Salle B","speakers":[{"id":"sbarkaouia726118deef0408188f1f7801f98444e","name":"Samya Barkaoui"},{"id":"pschmidt65da0a76e85f4934bba669c0806d98cc","name":"Pierre Schmidt"}],"summary":"**Pitch**\n\nData Scientist, just like their ancestors, Statisticians and Computer Scientists work on notoriously complex subjects with advanced methods... yet their expertise and their practices have a growing impact of everyone lifes. We aim to demonstrate that data storytelling, its concepts and tools are key to the future of data science because of it's power to tell about complex data insights to everyone.","title":"🇬🇧 Visualizing algorithms - Toucan-Toco","toTime":"2018-05-17 17:20","type":"Talk"},{"conferenceId":"cc-20180517","fromTime":"2018-05-17 17:30","id":"cc-2lpkq6nkarg8efvk3m425i4ihm","kind":"keynote","room":"Salle A","speakers":[{"id":"abensoussane9113c70a1bc47d189ea0401ecfd4b29","name":"Alain Bensoussan"}],"summary":"In a hyperconnected world and a few days before the application of the GDPR, the question of the ownership and monetization of personal data is in the limelight. The right for everyone to put a price tag on their own information seems unavoidable in the long run.","title":"🇫🇷 Keynote - Alain Bensoussan","toTime":"2018-05-17 18:00","type":"keynote"}]