[{"conferenceId":"cc-20181120","fromTime":"2018-11-20 08:45","id":"cc-2vsctngf9csg1de7ca9kl38s1h","kind":"keynote","speakers":[{"id":"mlevyf06ef4080ee843e082da82289b2ba3a9","name":"Maurice Levy"},{"id":"llegardeur94c0d32b428e4134a81e482c561b7af1","name":"Luc Legardeur"}],"title":"Accueil et Petit déjeuner","toTime":"2018-11-20 09:20","type":"keynote"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:45","id":"cc-565f1qeck1fi179lvmp8p4tthr","kind":"keynote","speakers":[],"title":"Pause Café","toTime":"2018-11-20 11:10","type":"keynote"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:50","id":"cc-46sp2nntcped0j8e7glo6rrvp2","kind":"keynote","speakers":[],"title":"Cocktail Déjeunatoire","toTime":"2018-11-20 14:15","type":"keynote"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:55","id":"cc-47stvcak1csa3f41ubejk16mup","kind":"keynote","speakers":[],"title":"Pause café","toTime":"2018-11-20 16:20","type":"keynote"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 18:00","id":"cc-7lad7up1sdntuirmgulkmaommb","kind":"keynote","speakers":[],"title":"Cocktail de clotûre","toTime":"2018-11-20 19:30","type":"keynote"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:00","id":"cc-5f880d0db0cfn7031m7v18blm2","room":"Code as a Passion","speakers":[{"id":"siha4d0236c9873a4af6a028b4c30ddc3d23","name":"Édouard Siha"}],"summary":"**Pitch**\nEn plus d'un siècle d'existence, la gestion de la circulation et l'organisation du métro parisien ont dû évoluer pour augmenter en permanence le débit tout en tenant compte des contraintes de sécurité. Vous commencez à comprendre où cette présentation veut en venir... \n\n\nLe temps de cette session, prenons un peu de recul sur notre cœur de métier : la création logicielle. Entre organisation du travail, amélioration d'un produit sur le long terme ou équilibre permanent qu'il faut trouver entre exploitabilité et sécurité, vous serez surpris de retrouver de nombreux parallèles et de voir ce qu'ils peuvent nous apporter.\n\n**Niveau**\nBusiness","title":"Ce que l'histoire du métro Parisien m'a enseigné sur la création logicielle","toTime":"2018-11-20 10:45","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-36qf9j5rsl7p6n88oo9qa5n0k4","room":"Code as a Passion","speakers":[{"id":"qjin86464f17557349e6bc2788e1f71c234f","name":"Qian Jin"}],"summary":"**Pitch**\nAvec une carte de développement Android Things, un module camera et votre Mac / PC, vous pouvez désormais créer un compagnon de jeu pour jouer au fameux Rock-Paper-Scissors-Spock-Lizard ! \n\nCe slot vous montrera comment entrainer un modèle de Machine Learning pour reconnaître les différents geste de la main, l'embarquer dans un device Android Things et créer une application pour jouer contre soi-même !\n\n**Niveau**\nTechnique intermédiaire\n\n#iot","title":"Jouer à Rock-Paper-Scissors-Spock-Lizard avec son Android Things","toTime":"2018-11-20 11:55","track":"IoT","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:05","id":"cc-2mqi40kagijig1vp319e646icc","room":"Code as a Passion","speakers":[{"id":"jsmadjad77e0b4c5d3d4d87816d52494ac4be75","name":"Julien Smadja"}],"summary":"**Pitch**\n\"Quand je serai grand je travaillerai chez SEGA\". Julien Smadja, 10 ans. \n\nÀ travers les différents média de la Pop Culture, nous allons étudier l'image des développeurs, entre mythe, réalité, fantasme et exagération.\nQuelle est l'image du développeur en 2018 ? Notre métier fait-il réver et donne-t-il envie aux jeunes et moins jeunes ?\n\n\n**Niveau**\nBusiness","title":"Le développeur dans la Pop Culture","toTime":"2018-11-20 12:25","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:30","id":"cc-1nvhgt588ki8r866hknqokavo7","room":"Code as a Passion","speakers":[{"id":"llegardeur94c0d32b428e4134a81e482c561b7af1","name":"Luc Legardeur"}],"summary":"**Pitch**\nMon rêve d'enfant était de devenir pilote. Devenu fondateur de Xebia, j'ai voulu assouvir cette passion et me suis inscrit dans un aéroclub.\n\n\nJe me suis lancé dans la construction d'un vrai simulateur de vol, monté sur vérins pour pouvoir progresser depuis chez moi. Entre la menuiserie, la mécanique, l'électronique, le software, il doit reproduire fidèlement les sensations vécues dans un vol à savoir restituer la réalité des terrains et des paysages, proposer tous les instruments de navigation d'un Cesna 172, simuler la météo et ses éventuelles perturbations et permettre  la communication radio.\n\nVenez vous familiariser avec le pilotable (virtuel) à travers ce projet passionnant et ambitieux, mais difficile !\n\n**Niveau**\nTechnique intermédiaire","title":"Comment créer un simulateur d'avion dans son garage avec un Arduino Micro","toTime":"2018-11-20 12:50","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 13:35","id":"cc-4dq3g2ds1do4diokcttigu39fk","room":"Code as a Passion","speakers":[],"title":"Burger Quiz","toTime":"2018-11-20 14:05","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-37tpt1gtvc0e47nlea046k90lv","room":"Code as a Passion","speakers":[{"id":"adergham415311e5b380476282bbc6769e55466b","name":"Alexandre Dergham"}],"summary":"**Pitch**\nPar curiosité, puis par passion, j'ai développé un jeu vidéo à l'aide des outils et frameworks habituellement utilisés dans des applications web. \n\nPas commun dites-vous ?\nRevenons ensemble sur la manière dont je m'y suis pris, les choix techniques et ce qui les a faits évoluer, les challenges et les compétences développées au cours de cette aventure.\n\n** Niveau **\nTechnique intermédiaire\n\n#back #front","title":"Comment j'ai développé un jeu vidéo avec des outils de développement web","toTime":"2018-11-20 15:00","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:10","id":"cc-707emja2sdkvf5iop651a9o9uk","room":"Code as a Passion","speakers":[{"id":"oghizzo6601880ac04a416cbdfddd9d9acfb13c","name":"Olivier Ghizzo"}],"summary":"** Pitch ** \nLes jeux videos c'est sympa, on aime tous y jouer !\n\nMais comment crée-t-on un jeu, quelles sont les étapes, les technologies pour y arriver ? C'est ce que l'on vous propose de découvrir via la création d'un jeu from scratch sur le moteur Unity.\n\n** Niveau **\nTechnique Intermédiaire\n\n#back","title":"Réaliser son jeu vidéo from scratch avec Unity","toTime":"2018-11-20 15:55","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-643hjn4b2cmg623k6qskkdr8b0","room":"Code as a Passion","speakers":[{"id":"sbuissonf4c736000b6540469c04609cac76b1b5","name":"Sarah Buisson"}],"summary":"** Pitch ** \nEt si le cerveau humain utilisait un algorithme pour la reconnaissance d'images ? \n\nExpliquons et comparons les algorithmes de reconnaissance de formes des ordinateurs et le fonctionnement neurologique du cerveau humain.\n\n** Niveau ** \nTechnique intermédiaire","title":"L'algorithme de reconnaissance de formes par le cerveau humain","toTime":"2018-11-20 17:05","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:15","id":"cc-2u8ud2hpagl0sv5r2l9nnu6qgo","room":"Code as a Passion","speakers":[{"id":"rsagean1818bbe80374440ea3cde07cac0eebe2","name":"Romain Sagean"}],"summary":"\n**Pitch**\nUne Data Visualisation permet en un seul coup d’œil de véhiculer des résultats (d'analyse). Au travers de contre-exemples bien choisis, nous allons voir les nombreux pièges qui nuisent à la lisibilité et l'interprétation des données et comment choisir la bonne représentation pour faire passer vos idées.\n\n**Niveau**\nBusiness\n\n#data","title":"Comment fausser l'interprétation de vos résultats avec des dataviz","toTime":"2018-11-20 17:35","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 09:20","id":"cc-2qtvgnpqpievfoqlqf47gp6kml","kind":"keynote","room":"Grand Auditorium","speakers":[],"summary":"Maurice Lévy fut président du directoire de Publicis Groupe pendant 30 ans et est maintenant Président du conseil de surveillance. Dans le cadre du rapprochement de Xebia France et Publicis Sapient, il nous apportera son éclairage sur la mutation du métier des géants de la publicité et mettra en perspective, le projet d’acquisition de Xebia par Publicis.Sapient.\n\n\nRetransmission de la Keynote en salle Notre Dame des Victoires et Petit Auditorium","title":"Keynote ouverture - Interview de Maurice Lévy, Président du Conseil de Surveillance chez Publicis Groupe","toTime":"2018-11-20 09:50","type":"keynote"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:00","id":"cc-7cnbm1lv98i6jum8ehalsa7ge9","room":"Grand Auditorium","speakers":[{"id":"ocloireccd2ff4ea01954b0381800798bccf5fbc","name":"Olivier Cloirec"}],"summary":"\n**Pitch**\nLe concept d'orchestration dans le domaine de l'informatique a été popularisé avec l'avènement des conteneurs. Mais il existe depuis bien longtemps en musique ! A-t-il la même signification dans ces deux contextes ? Peut-on vraiment établir un parallèle ? Et le chef d'orchestre dans tout cela, y trouve-t-il sa place ?\n\nNous aborderons la question dans cette conférence au travers d'exemples concrets et de démonstrations, dans le but de vous en faire ressortir avec de solides notions d'orchestration(s) ... et de bonne musique.\n\n**Niveau**\nBusiness\n\n#devops","title":"Orchestration : Conteneurs vs Musique","toTime":"2018-11-20 10:45","track":"DevOps","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-7el0lu85patbauetfedrt3uja4","room":"Grand Auditorium","speakers":[{"id":"aginiers511d718d17624989b7fb6b0c3bd0e401","name":"Anthony Giniers"}],"summary":"**Pitch**\nQu’est-ce qu’une application web à l’état de l’art en 2018 ? \n\nEn évolution constante, les standards changent d’année en année et il faut régulièrement se mettre à jour sous peine d’être à la traîne. Si vous n’avez pas encore surfé sur la vague Progressive Web App, Server-Side Rendering ou encore Code Splitting, ce talk est pour vous. Il vous fera découvrir les pratiques et les outils d'une stack web moderne.\n\n**Niveau**\nTechnique intermédiaire\n\n\n#front","title":"La web app d'aujourd'hui et de demain : état de l'art et bleeding edge","toTime":"2018-11-20 11:55","track":"Front","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:05","id":"cc-08dc4js4o9j199i6qkabefmhtc","room":"Grand Auditorium","speakers":[{"id":"achotard60b5f3d9e21c4b099277ba9597511860","name":"Alexis Horgix Chotard"}],"summary":"**Pitch**\nVous avez beau avoir modernisé vos applications, les avoir rendu stateless, 12factor-compliant, etc., si vous n'avez pas l'infrastructure pour les déployer proprement et les gérer, votre bénéfice final sera fortement amoindri.\n\nCette conférence a pour but de vous faire ressortir avec une définition et une vision claires des principaux concepts qui caractérisent une infrastructure moderne. Nous y parlerons Configuration Management, infrastructure immuable, infra-as-Code, orchestration, self-healing, systèmes distribués, applications Cloud Native, Serverless ... et ce n'est qu'un avant goût !\n\n**Niveau**\nTechnique intermédiaire\n\n#devops #cloud #back","title":"Modern infrastructure","toTime":"2018-11-20 12:50","track":"Cloud","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-33rgvhlnd304vdhg8s0i8tcsej","room":"Grand Auditorium","speakers":[{"id":"mantoine56a0ab452a1a407fa6f94547ba9e6cd4","name":"Marcou Antoine"},{"id":"lchristophe4bce28e1ec564d22acf89bf7390dd710","name":"Lefevre Christophe"}],"summary":"\n** Pitch ** En 2017, la DSI Natixis inscrit sa transformation agile comme l'une de ses ambitions stratégiques.\n\nEn tant que responsable de sa Digital Factory, le 89c3R, Christophe est chargé de lancer le projet. \n\nOr, transformer la culture d'une grande banque française durablement, n’est=ce pas mission impossible ?\n\nCommence alors l’histoire d’une transformation pas comme les autres. Car, pour la réussir, Christophe prend le pari audacieux de conduire le projet de manière agile, lui aussi.\n\nC’est cette histoire que Christophe viendra partager pour inspirer celles et ceux qui ont l’ambition de faire basculer nos grandes organisations traditionnelles dans une culture agile.\n\n** Niveau **\nBusiness\n\n#agile\n#rex ","title":"REX Natixis","toTime":"2018-11-20 15:00","track":"Agile","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:10","id":"cc-0g5f73cvk5ltu9853qg61b16kc","room":"Grand Auditorium","speakers":[{"id":"kalexis58880bc5dded4d33bfe9a19f35a67173","name":"Kinsella Alexis"},{"id":"gnezha4a08c62021a34e229ef3751815db11ab","name":"Grada Nezha "}],"summary":"** Pitch ** \n\"Nous avons la conviction qu’une architecture ne peut être validée que si elle survit à son implémentation\". \n\nUn atelier d'eXtrem Archi est un point de départ, et non une conclusion à une réponse apportée à une problématique posée. C'est pour cette raison que Xebia se propose d'accompagner ses clients, par une réponse d'architecture, mais également par un changement de paradigme dans la façon de mener les projets avec ses clients.\n\nC'est dans cet esprit que nous nous sommes donné 3 mois pour valider, via la réalisation d'un MVP, la proposition qui a découlé d'ateliers d'eXtrem Archi menés avec Sanofi pour monter un Datalake industrie dans le Cloud d'AWS.\n\nCe que nous vous proposons dans ce REX, c'est de revenir sur le chemin qui a permi à Sanofi et Xebia, à partir des conclusions de l'atelier d'eXtrem Archi de construire un produit fini qui réponde à la notion de Minimum Viable Product énoncée lors des ateliers d'eXtrem Archi. \n\nNous passerons en revue les challenges d'organisation projet, de culture d'entreprise, et de contraintes qualité imposés par un acteur global du monde pharmaceutique. Les problématiques qui ont été posées et comment nous les avons résolues.\n\n\n\n** Niveau **\nBusiness\n\n#rex\n\n#data #cloud","title":"eXtrem Archi et après ... De la théorie à la pratique, avec la mise en place du Datalake \"Industrie\" de Sanofi","toTime":"2018-11-20 15:55","track":"Cloud","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-241e93n9oa6mtkr86qqcmp7c1o","room":"Grand Auditorium","speakers":[{"id":"lperot9e04ab37ac1749828c1f87c1ad969d1c","name":"Ludovic Perot"},{"id":"pjulienc6dd64053a054e79a58f415c09e5e5b5","name":"Pierré Julien"},{"id":"dchlo4cd8505ed10445a49dc530e3e4774cd8","name":"Dumolard Chloé"},{"id":"mjulienc947a43c85324e87a1489bc2be8b2320","name":"Michaux Julien"}],"summary":"** Pitch ** \nEn Janvier 2017, Europ Assistance lance un projet ambitieux : refondre et unifier les SIs qui gèrent près de 5 millions d’interventions de dépannage à travers le monde. C’est l’histoire d’une transition qui s’effectue : on délivre un produit, et non plus un projet, en itérations courtes, et non pas en bloc de deux ans. \n\nCette présentation est un retour sur les difficultés et succès vécus quand on remplace plusieurs legacies par un MVP...\n\n** Niveau ** \nBusiness\n\n#rex\n#agile","title":"REX DRSA - Comment tuer trois legacies : le Maximum Viable Product","toTime":"2018-11-20 17:05","track":"Agile","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:15","id":"cc-26p12u16etmppvds9gpvrlatqn","room":"Grand Auditorium","speakers":[{"id":"scivettaedbd0d6df7af4a9182d49afd5bcb3df2","name":"Simone Civetta"},{"id":"psendorek52991e0fd4a74034aab65b5fe22aa262","name":"Pierre Sendorek"}],"summary":"** Pitch **\nVous pensiez avoir tout vu en matière d’applications mobiles ? \nEt si, nous  vous montrions comment faire cohabiter Deep Learning, réalité augmentée et 3D au sein d’une application mobile ? \n\nVotre téléphone est prêt à vous surprendre une fois de plus.\n\n** Niveau**\nTechnique intermédiaire\n\n#data #mobile","title":" Xebimon - Gotta catch’em all","toTime":"2018-11-20 18:00","track":"Mobile","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:00","id":"cc-6c1q5tho382ukmddt7pjpv4mm1","room":"Notre Dame des Victoires","speakers":[{"id":"dortega2d9d8baf0e5a414395e19e53a12dafcd","name":"Diana Ortega"},{"id":"ysennoun6391215aaee24278baaaecc500d634b6","name":"Yassir Sennoun"},{"id":"sbenfredj7cd01cd3ae5242c0b436db78552d617f","name":"Sameh Ben Fredj"}],"summary":"**Pitch**\nAujourd'hui accessibles partout, les objets connectés suscitent de plus en plus d’intérêt. Malgré cela, l’implémentation d’un projet IoT peut s’avérer compliquée au vu la diversité des dispositifs, protocoles et frameworks. Le nombre d'alternatives qui se présentent à nous est énorme.\n\n\nEn partant de l'embarqué, avec les protocoles applicatifs, jusqu'au déploiement d'une solution sur le cloud, en passant par la délégation des traitements en local via l'IoT Edge, nous rentrerons dans le détail de l'implémentation d'une solution IoT de bout en bout, le tout en comparant deux solutions : AWS et Azure.\n\n**Niveau**\nTechnique intermédiaire\n\n#iot #cloud #data","title":"IoT: From Edge to Cloud","toTime":"2018-11-20 10:45","track":"IoT","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-4oddbv54qu19kul89r9gd9fcmv","room":"Notre Dame des Victoires","speakers":[{"id":"ablouzab5013d68c6f7409da4571a8f9a65e34f","name":"Akram BLOUZA"},{"id":"dcaramelo9f605e0c38094539ac06c4a286d1e1fb","name":"David CARAMELO"}],"summary":"**Pitch**\nLors de cette session, vous verrez que le passage au cloud avec AWS permettra de répondre aux exigences les plus pointues en terme de qualité et de sécurité.\n\nAprès avoir présenté brièvement le projet Lumo (plateforme d'épargne participative dédiée aux énergies renouvelables) et son architecture initiale, nous rentrerons dans le vif du sujet pour vous exposer l’architecture AWS cible, en abordant l’ensemble des solutions apportées sur les aspects sécurité, résilience et haute disponibilité.\n\nEnfin, vous aurez un aperçu sur la solution apportée pour la chaîne de déploiement de Lumo dans AWS.\n\n**Niveau**\nTechnique intermédiaire\n\n#rex\n#cloud #devops","title":"L’expérience AWS avec Lumo à la Société Générale","toTime":"2018-11-20 11:55","track":"Cloud","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:05","id":"cc-1gf8ikotgeu0duqi4g3hv7qcju","room":"Notre Dame des Victoires","speakers":[{"id":"agirault30c3c45fbc744e4da41bc00baf6b0ea9","name":"Anne-Sophie Girault"}],"summary":"**Pitch**\nQue se passe-t-il dans nos têtes en permanence lorsque nous sommes à plusieurs et pourquoi ces mécanismes psychologiques s'activent ? Pourquoi passe-t-on notre temps, malgré nous, à jouer à des jeux psychologiques ? Que dit-on après avoir dit bonjour ? Comment nait et évolue un groupe dans le temps ? Comment repérer quand il dysfonctionne ? Les individus et leurs interactions plus que les processus et les outils ? \n\nPour toute personne qui ne vit pas seule dans une grotte, ce sujet se veut utile et pourquoi pas intéressant ;)\n\n**Niveau**\nBusiness\n\n#agile","title":"Structuration du Temps et Dynamique de Groupes, Théorie organisationnelle de Berne, une autre approche agile","toTime":"2018-11-20 12:50","track":"Agile","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-7kmaf7ilo79ll2bd7knt6cb4e3","room":"Notre Dame des Victoires","speakers":[{"id":"ibeauvaisbee22dbe9683439c9a711f90ccc05207","name":"Ivan Beauvais"},{"id":"eacquarone3f64c2dfd1b049c68f549bbc7f8ab0eb","name":"Enguérand Acquarone"},{"id":"mvaudiau71b0575fd2d74a1286d7f45bd7790171","name":"Marc Vaudiau"}],"summary":"\n**Pitch**\nLes Datalake, c’est un peu le Saint-Graal des grosses entreprises et on en voit partout. Chez Xebia, nous en avons mis un en place, on-premise, aux Galeries Lafayette. Alors pourquoi sommes nous en train de le migrer vers Google Cloud et du 100% services managés ? Quelles sont les conséquences techniques et organisationnelles, les écueils rencontrés et nos solutions pour les éviter ? Quel impact sur la Data Science ce changement va-t-il avoir ?\n\n\nVenez découvrir, sans détour ou embellissement, ce que donne un Datalake sur GCP !\n\n** Niveau **\nTechnique intermédiaire\n\n#rex\n\n#cloud #data","title":"Migration d'un Datalake vers Google Cloud aux Galeries Lafayette","toTime":"2018-11-20 15:00","track":"Cloud","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:10","id":"cc-0if8ak8t2sgted12p4evjbbfce","room":"Notre Dame des Victoires","speakers":[{"id":"ligord83303bc2d6a434182e3a1c3ac449174","name":"Lovich Igor"},{"id":"vwilfried367d9145209742ad9642c927b1fa3ce1","name":"Villisek Faucounau Wilfried"}],"summary":"** Pitch **\nLe contexte bancaire complexifie la marge de manœuvre pour mettre en place une démarche DevOps : régulateurs, protection des données, ségrégation prod/dev, processus de validation sécurisé... Tout pourrait paraître contradictoire avec un concept de collaboration étroite entre les dev et les ops. \n\nNous allons vous présenter comment nous sommes devenus DevOps, avons rendu l’ownership aux développeurs sur le pipeline de livraison en production sans sacrifier les aspects de sécurité et par la même occasion, avons réduit les coûts de livraisons. \n\nDans la deuxième partie de la conférence nous vous présenterons comment nous avons évité la catastrophe en mettant une bonne dose de Craftsmanship dans le setup DevOps.\n\n** Niveau**\nTechnique Intérmediaire\n\n#craft #devops","title":"The DevOps Craftsmen","toTime":"2018-11-20 15:55","track":"Craft","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-6dklpklo67hqjsr203fgu4s5sk","room":"Notre Dame des Victoires","speakers":[{"id":"pdjardin6d8b37bc43a64b63894f92fb11b24752","name":"Paul-Guillaume Déjardin"},{"id":"blacroixf433111c182c4429819442379437fc1a","name":"Benjamin Lacroix"}],"summary":"** Pitch ** \nKotlin est un excellent langage , mais comment le propulser sur son provider cloud favori ?\n\nQue ce soit sur AWS ou GCP cette Konférence vous montrera les techniques, astuces et avantages du langage pour des déploiements en mode IaaS, PaaS et bien sur Serverless.\n\nNous montrerons également, comment Kotlin permet d'écrire du code \"propre\" tout en minimisant le vendor lock-in.\n\n** Niveau ** \nTechnique intermédiaire\n\n#cloud #back","title":"Kotlin dans ton Cloud","toTime":"2018-11-20 17:05","track":"Cloud","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:15","id":"cc-2cgp1u8dr7t1c9sg0pcv062g2h","room":"Notre Dame des Victoires","speakers":[{"id":"ybenoit398c2ce35c444d3bb25ca497b7f5f9f5","name":"Yoann Benoit"},{"id":"nchauliace951bc26b19045d79f86dcb66f48cf6d","name":"Nathan Chauliac"}],"summary":"** Pitch **\nProofs of Concepts interminables, algorithmes complexes impossibles à déployer en production, résultats échouant à créer de la valeur…\n\nBercés par la croyance largement répandue que l’exploitation d’une grande quantité de données, combinée avec des algorithmes de pointe, suffisent à créer de la valeur, beaucoup se lancent dans des projets Data Science tous azimuts en réunissant les deux ingrédients clés : un Data Lake qui contiennent toutes les données possible et une équipe de Data Scientists de pointe. Et autant se le dire, le chemin à parcourir pour réussir ses projets est souvent très long, voire inaccessible.\n\nAu cours de cette présentation, nous allons vous inviter à prendre du recul sur ces incroyables promesses rattachées à l’Intelligence Artificielle, et à réfléchir en termes de produit complet. De la découverte des problèmes pertinents au développement itératif de la solution, nous vous invitons à découvrir une méthodologie permettant de développer un produit Data Science qui délivre réellement de la valeur aux utilisateurs.\n\n** Niveau**\nBusiness\n\n#data","title":"Data Science Done Wrong - Les 5 idées reçues qui condamnent votre projet Data Science à l'échec, et les changements de perspectives qui peuvent vous aider à l'éviter.","toTime":"2018-11-20 18:00","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:00","id":"cc-2nho0bgmqb9b930jv7mti21n64","room":"Petit Auditorium","speakers":[],"summary":"Databricks Unified Analytics Platform, fondée par les créateurs d'Apache Spark est la plateforme Spark cloud native la plus performante, la plus simple d'utilisation. \n\nVenez découvrir comment mettre en oeuvre vos pipelines ETL, ML et DL avec Databricks ainsi que les dernières innovations avec mlflow et l'intégration des frameworks de deep learning.\n\n** Niveau **\nTechnique intérmediaire\n\n#data","title":"Accélérer l’innovation en unifiant données et IA","toTime":"2018-11-20 10:20","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:25","id":"cc-1p650uur268n3j3eeahe1q4tml","room":"Petit Auditorium","speakers":[{"id":"tgeoffrey1304df80ea7c489097e4579d204ad8ea","name":"Thiesset Geoffrey"}],"summary":"\n**Pitch**\nLe groupe Renault a décidé de mettre en place un Data Lake Hybride (on premise &amp; cloud), Pour ces raisons, une gouvernance sur ces données - et l'outillage transverse nécessaire pour manager ce patrimoine de données - est devenue cruciale. En 20 minutes, Geoffrey Thiesset - Datalake Design &amp; Build Manager - partagera avec l'audience la vision de ce qu'est une gouvernance des données pour l'entité Renault Digital, les actions déjà mises en place et celles à venir.\n\n**Niveau**\nBusiness\n\n#rex #data #agile","title":"La gouvernance des données chez Renault Digital","toTime":"2018-11-20 10:45","track":"Data","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-2qins4042gjom8rbv8talbdj5v","room":"Petit Auditorium","speakers":[{"id":"aletaxin1bffef81221a4c148fbddcb54c362d0a","name":"Antoine Le Taxin"},{"id":"mpichou6ac58e8bf4264574b20db908c825f20d","name":"Maxime Pichou"}],"summary":"**Pitch**\nLe créateur de NodeJS, Ryan Dahl, a décidé de créer un nouveau runtime pour Javascript : Deno. Son but ? Eliminer les erreurs et maladresses de son grand frère. Découvrez ce qui se cache derrière ainsi que la vision de son créateur.\n\n**Niveau**\nTechnique intermédiaire\n\n#back","title":"Deno, le nouveau NodeJS qui inverse la tendance ?","toTime":"2018-11-20 11:30","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:35","id":"cc-21iafat9qtq8idbhpqlfvmla9n","room":"Petit Auditorium","speakers":[{"id":"dbaron88f5197670b84fa38182674eb2dcc47c","name":"Damien Baron"},{"id":"jpinsolle1d70c24c67684a12a036ea6d2969f392","name":"Jérémy Pinsolle"}],"summary":"**Pitch**\nMettre en place un mécanisme d'identification et d’authentification n'est jamais chose facile. API keys, tokens, session id, les solutions ne manquent pas, mais beaucoup de zones d'ombre persistent encore.\n\n\nMais tout n'est pas perdu ! Aujourd'hui, OpenID Connect constitue un bon moyen de reprendre la main sur ce mécanisme charnière. \nVenez donc découvrir avec nous en quoi consiste cette norme déjà largement répandue, et comment l'utiliser efficacement.\n\n**Niveau**\nTechnique intermédiaire\n\n#back","title":"Sécuriser son API avec OpenID Connect","toTime":"2018-11-20 11:55","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:05","id":"cc-6obmv56uq2tdfmhibosvljrgfm","room":"Petit Auditorium","speakers":[{"id":"jraffreb15b94b89ffb43908292ccc911ca0f13","name":"Jonathan Raffre"}],"summary":"\n** Pitch** \nLa sécurité, cette branche de notre domaine dont le devoir est de protéger le système d'information, revient très souvent comme un point de douleur dans toutes les étapes du cycle de vie d'un projet. Pourtant, malgré une nécessité réelle, un bon nombre des mesures prises sont incomplètes, voire inutiles.\n\nDes politiques de mot de passe aberrantes au proxy ne limitant en pratique que peu de choses, ce slot tentera de démystifier les principes clés de la sécurité et d'expliquer pourquoi un certain nombre des mesures courantes dans les entreprises n'ont en réalité qu'un effet placebo.\n\n** Niveau**\nTechnique intermédiaire\n\n#back","title":"La sécurité, douce illusion même en 2018","toTime":"2018-11-20 12:25","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:30","id":"cc-445nduea1dfctaj7m3lldbesu4","room":"Petit Auditorium","speakers":[],"summary":"Devant le nombre grandissant de secrets (API Keys, SSH Keys, ...) utilisés au sein de l'outillage DevOps et des applications Cloud Native, découvrez comment en centraliser la gestion sans impacter les développeurs et compromettre la dynamicité, la scalabilité ainsi que l'automatisation mises en place.\n\n**Niveau**\nTechnique intérmediaire\n\n#devops #backend","title":"Secrets management et DevOps : (re)prenez le contrôle !","toTime":"2018-11-20 12:50","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-042u6i03pe85up2ufa2b3bs4dr","room":"Petit Auditorium","speakers":[],"summary":"La gestion de gros volumes de données tout comme l’augmentation de bases utilisateurs restent un challenge pour de nombreuses entreprises aujourd’hui. \n\nÀ travers l'étude de cas clients vous découvrirez comment Snowflake révolutionne la façon dont les entreprises gèrent les données et l'utilisation des outils d'analyses, leur permettant ainsi de rester compétitives, efficaces et réactives.\n\n**Niveau**\nBusiness\n\n#cloud","title":"Optimisez la gestion des données et l'utilisation des outils analytiques de votre entreprise avec Snowflake","toTime":"2018-11-20 14:35","track":"Cloud","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:40","id":"cc-5qv6tinb81g5ma5d58mr14lm19","room":"Petit Auditorium","speakers":[{"id":"pdjardin6d8b37bc43a64b63894f92fb11b24752","name":"Paul-Guillaume Déjardin"}],"summary":"** Pitch** \nSur l'un des tee-shirt Docker, il est écrit \"The revolution will be containerized\".\n\nLa révolution est en marche, mais comme pour toutes révolutions, elles laissent beaucoup de questions et de chaos.\nDans le cas de notre révolution, les outils pour la métrologie et les métriques évoluent. Pour Docker, il existe un outils appelé Prometheus qui remplit parfaitement ce rôle. Mais c'est au développeur d'envoyer les métriques (techniques, business).\n\nDécouvrez comment un développeur NodeJS peut envoyer ses métriques à Prometheus ainsi qu'un petit utilitaire que j'ai réalisé pour simplifier cette mise en place.\n\n** Niveau**\nTechnique intermédiaire\n\n#back #devops","title":"Monitorer son application nodejs dans un container","toTime":"2018-11-20 15:00","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:10","id":"cc-27d1r997ib48vd3vf7bb2i2rub","room":"Petit Auditorium","speakers":[{"id":"ybenoit398c2ce35c444d3bb25ca497b7f5f9f5","name":"Yoann Benoit"}],"summary":"** Pitch ** \nLorsque la quantité de données est très grande et que l'architecture de votre réseau de neurones est complexe, la question du temps d'entraînement et de la capacité de votre machine deviennent primordiales. Un entraînement de modèle peut vite prendre plusieurs heures voire jours, ou même ne pas tenir en mémoire. Il est alors temps de parler de Deep Learning distribué !\n\nAu cours de cette présentation, nous allons voir différentes solutions et bonnes pratiques pour accélérer l'entraînement de modèles de Deep Learning en les distribuant sur un cluster ou sur des plateformes multi-GPUs.\n\n** Niveau **\nTechnique intermédiaire\n\n#data","title":"Boostez vos modèles avec du Deep Learning distribué","toTime":"2018-11-20 15:30","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:35","id":"cc-3aq0fdr2ebirtaprkkdpssf2i0","room":"Petit Auditorium","speakers":[{"id":"ldivaddacf9ef2bef44bbf971870b77a64a319","name":"Loïc Divad"}],"summary":"** Pitch ** \nL’Auto Scaling, c’est l’argument phare d’un bon nombre de technologies en Data Engineering. Parmi les outils du moment, on retrouve Kafka-Streams. Avec sa forte intégration au bus de message Apache Kafka, il est pensé pour être un framework distribué capable de passer à l’échelle. Pourtant, dans la pratique, sa seule utilisation est limitée, et l’orchestration de ces applications est généralement nécessaire.\n\n\nDans ce talk, nous parlerons de conteneurisation, d’orchestration et de monitoring, qui sont des éléments clefs qui nous permettront de profiter pleinement de la scalabilité des applications Kafka-Streams, le tout autour de technologies comme Kubernetes et Stackdriver.\n\n** Niveau **\nTechnique intermédiaire\n\n#data","title":"Passage à l'échelle de mes applications Kafka-Streams","toTime":"2018-11-20 15:55","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-6j9vpd8i68enub05tfnifesdkd","room":"Petit Auditorium","speakers":[{"id":"rsagean1818bbe80374440ea3cde07cac0eebe2","name":"Romain Sagean"}],"summary":"** Pitch ** \nDepuis quelques années, les notebook ont gagné en popularité. Apache Zeppelin, avec son architecture modulaire, offre une solution de notebook et de dashboarding, le tout sans mettre de côté la sécurité. \nCette présentation vous fera découvrir cet outil merveilleux dont vous ne pourrez bientôt plus vous passer.\n\n** Niveau ** \nTechnique intermédiaire\n\n#data","title":"Des notebook pour le monitoring avec Zeppelin","toTime":"2018-11-20 16:40","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:45","id":"cc-6vu4ef7ogb2h6cr0roriief014","room":"Petit Auditorium","speakers":[{"id":"adeamaral0c823478a7ea4a678fe8116e0449d9a3","name":"Aurore De Amaral"}],"summary":"** Pitch ** \nDepuis la sortie d'une librairie pour le TAL (NLP) pour Spark en 2017, que pouvons-nous faire maintenant avec elle ? E\nxemples et retours en comparaison avec d'autres produits open source sur le sujet.\n\n** Niveau ** \nTechnique intermédiaire\n\n#data\n#cloud","title":"Spark NLP, un an après","toTime":"2018-11-20 17:05","track":"Cloud","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:15","id":"cc-7rukdatcdttfrkt8s9j9fp5qec","room":"Petit Auditorium","speakers":[{"id":"jpastanted737a2fa5a1456392d99bde7e0e64b7","name":"Jean-Christophe Pastant"}],"summary":"**Pitch**\nVous avez l’impression que vous devez jeter la moitié de votre code tous les 6 mois ? Plus le temps passe, moins votre application mobile est maintenable ?\n\nInjection de dépendances, routage ou gestion des environnements, venez découvrir nos conseils pour vous aider à réaliser des applications mobiles évolutives conçues pour durer dans le temps.\n\n**Niveau**\nTechnique intermédiaire\n\n#mobile","title":"Architecturer son application mobile pour la durabilité","toTime":"2018-11-20 17:35","track":"Mobile","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:40","id":"cc-3d3aooesp67r82410lmo3i6vla","room":"Petit Auditorium","speakers":[{"id":"aletaxin1bffef81221a4c148fbddcb54c362d0a","name":"Antoine Le Taxin"}],"summary":"**Pitch**\nAprès TypeScript, Flow et Elm, venez découvrir Reason ! Nouveau langage développé par Facebook, Reason est multi-paradigme (mais plutôt fonctionnel) et se base sur OCaml avec une bibliothèque officielle de binding vers React. \n\nAu travers d'exemples, nous verrons ensemble les principaux bénéfices du langage, ses particularités, ses outils et son intégration avec React.\n\n**Niveau**\nTechnique intermédiaire\n\n#front","title":"React, l'âge de Reason","toTime":"2018-11-20 18:00","track":"Front","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:00","id":"cc-65vkbfe69vrpkmju6gv58hu3rp","room":"Salle des Engrenages","speakers":[{"id":"sguedon79e619b1e5bf414c8883c0089c112315","name":"Stéphane Guedon"},{"id":"iroques0c2d99bee5f14edd81e585aeb07b1bb8","name":"Isabelle Roques"}],"summary":"\n**Pitch**\nNous passerons en revue plusieurs framework à l'échelle dans une optique sans à priori, puis nous nous concentrerons sur les nombreuses ressemblances et problématiques communes pour ébaucher un minimum minimorum de l'agilité à l'échelle.\nCependant, comprendre n'est pas implémenter ! Nous aborderons donc ensuite comment choisir chaussure à son pied en fonction de la culture, de l’organisation et de l'architecture technique en place dans votre entreprise ou dans votre structure.\n\nComme conclusion, nous verrons comment aller progressivement vers la cible retenue avec certaines erreurs à éviter!\n\n**Niveau**\nBusiness\n\n#agile","title":"Scaling : framework ou pas framework ?","toTime":"2018-11-20 10:45","track":"Agile","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-19bhekjchvt6nah3slnrolirv7","room":"Salle des Engrenages","speakers":[{"id":"mblanccce3fb01f61244e882dac15130294ac8","name":"Matthieu Blanc"}],"summary":"**Pitch**\nLa faible maturité des projets de gouvernance des données nécessite la mise en place de bonnes pratiques et boucles de feedback pour constamment monitorer et valider le bien fondé des règles de gestion sur votre patrimoine data. Découvrons ensemble les caractéristiques d’une gouvernance des données à approche agile et ses bénéfices.\n\n**Niveau**\nBusiness\n\n#data","title":"Pourquoi construire une gouvernance de données dite agile ?","toTime":"2018-11-20 11:55","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:05","id":"cc-70iunu7psoohv1ge2uh8sdg2o4","room":"Salle des Engrenages","speakers":[{"id":"lnicolas43d5b654caa947ee8422c8fc70fd225e","name":"Laille Nicolas"},{"id":"vpaullouis81da76185eb048e08cc8288345beef41","name":"Vincenti Paul Louis"}],"summary":"**Pitch**\nAprès une grande réussite sur la mise en place de la maintenance prédictive pour sa flotte d’avion, Air France a voulu passer à l’échelle en proposant ce service à ses airlines clientes. \nPour se lancer dans ce défi, Air France a fait appel à Xebia, ce qui a donné lieu à une session d’eXtrem Architecture.\n\nCe REX a pour but de faire découvrir l'eXtrem Architecture à l’audience, en commençant par la théorie pour finir sur les atouts que celui-ci a offert à Air France avant de se lancer dans l’aventure.\n\n**Niveau**\nBusiness\n\n#rex\n#data #cloud","title":"Air France dans les nuages","toTime":"2018-11-20 12:50","track":"Cloud","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-34fa0h6h3icnfmhu4otpl70il0","room":"Salle des Engrenages","speakers":[{"id":"sdossantosd85d961a9a5748cbb31391505dfe374e","name":"Sergio Dos Santos"}],"summary":"\n**Pitch**\nOn vous vend la mèche, le service mesh fera parler de lui en 2019.\n\nDans un contexte d'applications cloud native et microservices, le service mesh se profile comme la solution répondant aux problématiques de multiplication des échanges entre applications : découverte de services, authentification, authorisation, traçabilité, etc. \n\nCette introduction au sujet vous présentera les possibilités de ce prochain buzzword, démos à l'appui. \n\nPromis, ça \"Envoy\" (entre autres : Linkerd, Istio, etc.) du lourd.\n\n** Niveau **\nTechnique intermédiaire\n\n#cloud #back","title":"Service mesh : la pièce manquante à vos applications Cloud et microservices","toTime":"2018-11-20 15:00","track":"Cloud","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:10","id":"cc-1rcd4ffcdn121io1bjicjd5p2k","room":"Salle des Engrenages","speakers":[{"id":"dortega2d9d8baf0e5a414395e19e53a12dafcd","name":"Diana Ortega"},{"id":"stricoiref8dd46c89b8d41139a2690433cc6c45e","name":"Sony Tricoire"}],"summary":"** Pitch ** \nGérer des milliers de vélos connectés disséminés aux quatre coins d’une grande ville, voilà un défi de taille ! \n\n\nNotre challenge : fournir des solutions fiables de gestion de cette flotte déployables rapidement. \nAu cours de ce retour d’expérience, nous vous montrerons comment nous avons conçu et implémenté cette solution de vélos connectés avec AWS IoT, en vous présentant les choix effectués et leurs raisons ainsi que les difficultés que nous avons rencontrées.\n\n** Niveau **\nBusiness\n\n#rex #cloud #iot","title":"Piloter son parc de vélos dans le Cloud : une expérience Serverless","toTime":"2018-11-20 15:55","track":"IoT","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-0aguev59ilseokpmmstm47cr2c","room":"Salle des Engrenages","speakers":[{"id":"varrocna652612109dc64470bac2562c15f2c431","name":"Vincent Arrocéna"},{"id":"jpinsolle1d70c24c67684a12a036ea6d2969f392","name":"Jérémy Pinsolle"}],"summary":"** Pitch ** \nAvec le succès des enceintes intelligentes, du NLP (Natural language processing), 2018 est incontestablement l'année des chatbots. Mais si en 2018 tu n'as pas codé ton chatbot, tu as raté ta vie de développeur !\n\nIl est temps de se rattraper et c'est pour cela que nous vous proposons de coder un chatbot en live pour briller en société. Succès garanti !\n\nAu programme, un peu d'historique (mais pas trop), des explications sur les concepts clés et surtout une démo garantie sans effet démo. À vos Amazon Lex et Dialogflow !\n\n** Niveau ** \nTechnique intermédiaire\n\n#back","title":"Codons un chatbot avec Amazon Lex et DialogFlow","toTime":"2018-11-20 17:05","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:15","id":"cc-3dv55aavvut5mov63m13q20m17","room":"Salle des Engrenages","speakers":[{"id":"vsegouin076883fa542c4c0f8f5ccb44a7c13244","name":"Vincent Segouin"}],"summary":"** Pitch **\nLa blockchain est la technologie buzzword du moment pour assurer une traçabilité des transactions. Beaucoup de personnes en parlent, mais très peu savent comment cela fonctionne réellement. Pire, de plus d'outils d'implémentations font leur apparition, et il est difficile de s'y retrouver.\n  \nThe Linux Foundation a créé Hyperledger Fabric, un framework permettant la réalisation d'un réseau de blockchain from scratch très prometteur, que nous allons décortiquer ensemble. Nous allons donc réaliser un tour d'horizon de ce qu'il permet et explorer les tenants et aboutissants de ce qu'est concrètement la réalisation d'un tel réseau.\n\nCette présentation a pour vocation de vous permettre de comprendre en détail le fonctionnement de cette technologie, et surtout d'être capable de savoir si elle peut répondre à vos besoins.\n\n** Niveau**\nTechnique intermédiaire\n\n#back","title":"Utiliser Hyperledger Fabric pour la création d'une blockchain privée","toTime":"2018-11-20 18:00","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-63e1uke50slir3qhrmpmjkr352","room":"Salle des colonnes","speakers":[{"id":"lperot9e04ab37ac1749828c1f87c1ad969d1c","name":"Ludovic Perot"}],"summary":"**Pitch**\nLe mouvement #noestimates déchaîne les passions. Des débats passionnés voire houleux ont eu cours à l'automne 2017. Mais d'abord, qu'est-ce que ce mouvement exactement ? Pourquoi, en IT, procédons-nous à des estimations ? \n\nSous la forme d'une joute verbale, préparez votre plaidoirie d'avocat du mouvement ou à l'inverse de procureur pour à la fin avoir une image globale des arguments des deux camps.\n\n**Niveau**\nTechnique intermédiaire\n\n#hands-on\n#agile","title":"Le procès de #NoEstimates","toTime":"2018-11-20 12:50","track":"Agile","type":"Hands'On"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-6v9mfhhg1cfccnt5bs6tjsqlkd","room":"Salle des colonnes","speakers":[{"id":"jclaramonte6e7e0d0be1d246caab90c55b277ec060","name":"Jean-Baptiste Claramonte"}],"summary":"** Pitch**\nLearn &amp; have fun en codant du serveless dans GCP ! \nChaque équipe représentera une société de livraison par drones. Elle devra coder et déployer des Cloud Functions pour répondre à des évènements de Pub/Sub et s'adapter pour gagner le plus de points. \nUn dashboard en temps réel permettra de rendre compte des déplaçements des drones sur la carte et des scores.\n\nQuelle sera la meilleure société ?\n\n**Niveau**\nTechnique Expert\n\n#hands-on\n#cloud","title":"Codez le meilleur service de livraison par drones via des Google Cloud Functions dans une battle en équipe","toTime":"2018-11-20 15:55","track":"Cloud","type":"Hands'On"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-1479b818n28750bq9l61s731pd","room":"Salle des colonnes","speakers":[{"id":"kalexis58880bc5dded4d33bfe9a19f35a67173","name":"Kinsella Alexis"}],"summary":"** Pitch ** \nSorti en 2017, le service AWS Greengrass permet d'exploiter le Cloud d'AWS pour déployer des capacités de calcul sur device, qu'il s'agisse de fonctions Lambda sur device ou encore de modèles d'inférence. \n\nToutefois, la prise en charge de ces capacités serait incomplète si les capacités de déploiments et les problématiques sécurité n'étaient pas prises en charge directement par le service.\n\nCe Hands-On se propose de faire découvrir le modèle de fonctionnement d'AWS IoT, ses capacités, mais également de comprendre comment déployer des capacités de calcul sur device.\n\nDes instances EC2 seront mises à disposition permettant d'expérimenter les services IoT d'AWS, dont AWS Greengrass grâce à des Notebooks interactifs Jupyter. \n\nNous nous attellerons en particulier à faire communiquer des devices entre eux ainsi qu'avec les services cloud d'AWS, puis nous déploierons un modèle d'analyse d'image basé sur Tensorflow pour identifier des objets sur un flux vidéo.\n\n** Niveau ** \nTechnique expert\n\n#cloud \n#iot","title":"Edge Computing et Computer Vision avec AWS Greengrass","toTime":"2018-11-20 18:00","track":"IoT","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:00","id":"cc-78do5aqsujal6v7ie20p86dk0i","room":"Salon Napoléon","speakers":[{"id":"cdufour942066726051434697eaff4c16fd903a","name":"Charles Dufour"}],"summary":"**Pitch**\nLe RGPD est entré en vigueur le 25 mai 2018 avec les implications que nous connaissons tous (droit à l'oubli, consentement explicite, sécurité par défaut, etc.)\n\nEn parallèle, nous développons de plus en plus d'architectures autour de l'Event Sourcing, qui par définition sauvegarde les données de manière immutable.\n\nMais alors, comment faire pour concilier une architecture autour de l'Event Sourcing, immutable, avec les restrictions imposées par le RGPD ?\nC'est ce que nous allons explorer durant cette session !\n\n**Niveau**\nTechnique intermédiaire\n\n#back","title":"Event Sourcing et RGPD, incompatibles ?","toTime":"2018-11-20 10:45","track":"Back","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-41j76u8d3vcf9sukceac62a7mc","room":"Salon Napoléon","speakers":[{"id":"dgasparinaee4f01741a1b4b05933519b957323d28","name":"Damien Gasparina"}],"summary":"** Pitch ** \nLorsque qu'Apache Kafka est utilisé dans des applications critiques, un déploiement stable et fiable est nécessaire dès le début.\nAu cours de cet échange, nous évoquerons les erreurs les plus communes rencontrées sur le terrain et comment les éviter.\n\nComment assurer la durabilité des message ? Quels sont les paramètres de configuration à connaître ? Et, avant tout, comment monitorer Apache Kafka ? Nous tenterons de répondre à ces différentes questions.\n\n** Niveau ** \nTechnique intermédiaire\n\n#data","title":"Apache Kafka - bonnes pratiques et erreurs courantes ","toTime":"2018-11-20 11:55","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:05","id":"cc-6975bnk1gu0rqi74iicqgtek40","room":"Salon Napoléon","speakers":[{"id":"vlandeau18c13c4f040448d9852a7b1479271259","name":"Victor Landeau"},{"id":"spietrowska0187879082e642ec9a65bf36bcff743d","name":"Sandra Pietrowska"},{"id":"rardiet99e429ed4f3a4cb1961c5b3a8dcd92b6","name":"Romain Ardiet"}],"summary":"**Pitch**\nDeep learning en production ? Oui(.sncf)! \nDécouvrez un REX de l’équipe ASTRO et du principal projet porté par celle-ci au cours des 12 derniers mois : OuiBoost est un ensemble d’algorithmes destiné à optimiser les achats médias de mots clés sur Google Adwords. \nNous allons nous focaliser sur la partie architecture technique ainsi que le fonctionnement de l’équipe agile pluridisciplinaire. #deeplearning #DLenproduction\n\n**Niveau**\nTechnique intermédiaire\n\n#rex\n\n#data","title":"OUI.sncf : Optimisation des enchères sur Google Adwords avec le Deep Learning","toTime":"2018-11-20 12:50","track":"Data","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-4d4ajbq3hh35jk8df5jq72ve2d","room":"Salon Napoléon","speakers":[{"id":"gbianchi0566359dfb8f4ec5bfcd802ca2daddf6","name":"Giulia Bianchi"},{"id":"ldivaddacf9ef2bef44bbf971870b77a64a319","name":"Loïc Divad"},{"id":"foueslatibb18abbc86af43fc83c53a4e1a7ffdd7","name":"Fares Oueslati"}],"summary":"**Pitch**\nLa création de produits Data Science comporte bon nombre de challenges techniques à relever pour aller jusqu'à la mise en production. Comment documenter et versionner ses modèles de Machine Learning ? Comment les déployer sur plusieurs plateformes ? Comment tracker et partager les expérimentations faites ? Comment savoir à quel modèle correspond une prédiction ?\n\nPour répondre à ce manquement dans les usines logicielles pour la Data Science, Databricks a récemment dévoilé un nouveau produit open source : MLFlow. Inspiré des différentes implémentations de Machine Learning Platforms, il a pour but d'offrir un meilleur cadre de développement pour les projets Data Science, et compte bien s'imposer comme un standard. Dans ce talk, nous vous proposons de revenir sur les différentes étapes à franchir tout au long du Machine Learning Lifecycle, et de décortiquer comment MLFlow peut répondre à ces besoins.\n\n** Niveau **\nTechnique intermédiaire\n\n#data","title":"MLFlow and the Machine Learning Lifecycle","toTime":"2018-11-20 15:00","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:10","id":"cc-3mv3f7rbj0q9r82km10hi93vop","room":"Salon Napoléon","speakers":[{"id":"ndufoss4e92123f96824b79962b15b8d7dafbb8","name":"Nelson Dufossé"}],"summary":"** Pitch ** \nDepuis quelques années, vous entendez parler de transformation d’entreprises permettant la diminution du Time-To-Market, le rapprochement des développeurs et opérationnels et la synchronisation des backlogs ou encore favorisant le plaisir au travail. Pourtant nous oublions l’essentiel, réaliser le bon produit répondant aux réelles problématiques des utilisateurs finaux. \n\nCe fondement est trop souvent oublié par toutes ces entreprises voulant monter vite sur l’agilité à l’échelle. Vous êtes vous déjà rendu compte à quel point cette clé de succès est oubliée ? Savez-vous pourquoi il faut mettre un point d’honneur à intégrer les utilisateurs finaux dans les projets ? \n\n** Niveau **\nBusiness\n\n#agile","title":"Les utilisateurs finaux, les oubliés de nos produits !","toTime":"2018-11-20 15:55","track":"Agile","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-200jonc6svi0p2illt7a0taccf","room":"Salon Napoléon","speakers":[{"id":"tauffredouf7e18d246fac4c0696f63c1a2f03ba66","name":"Thomas Auffredou"},{"id":"vludovic11356377558c482d851518527af97bca","name":"Vielle Ludovic"}],"summary":"** Pitch ** \nJobTeaser est le leader européen du recrutement des jeunes talents. Nous nous sommes donnés pour mission de préparer la nouvelle génération à révéler tout son potentiel, pour s'accomplir, et en faire bénéficier la société. C’est l’histoire de la migration d’une plateforme vers Kubernetes. \n\nCette histoire commence par les raisons qui nous ont conduites à engager cette migration. Rien n’est jamais aussi simple que prévu, aussi nous reviendrons sur les intentions initiales. \n\nLes conteneurs changent la manière de développer et de déployer nos applications. Parfois souhaitées, parfois contraintes nous vous partagerons ces détails qui font toute la différence, qu’il s’agisse de build, de déploiement, de sécurité ou d'exploitation.\n\n** Niveau **\nIntérmediaire\n\n#rex\n#devops","title":"Jobteaser, destination Kubernetes","toTime":"2018-11-20 17:05","track":"DevOps","type":"REX"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:15","id":"cc-5kv3ji2eeepa4a7lnomkkcrnfs","room":"Salon Napoléon","speakers":[{"id":"bbouchahouaeee51fe1bf6345c9a9fb2c3cdef0952d","name":"Bruno Bouchahoua"}],"summary":"**Pitch**\nTerminé l'adminstration de cluster Hadoop !\nDepuis l'arrivée de la version 2.3 de Spark, il est maintenant possible de lancer des jobs sur un cluster Manager Kubernetes. Ce slot se propose de vous faire découvrir Spark sur un cluster manager Kubernetes mais pas seulement.\n\nIl se propose également de montrer les nouvelles façons de faire du Spark sans être dépendant d'une distribution Hadoop tout en interagissant de manière sécurisée avec un stockage de masse.\n\nToutes ces solutions seront présentées à l'aide d'un provider de Cloud. Vous découvrirez lequel durant la présentation.\n\n**Niveau**\nTechnique expert\n\n#data","title":"Spark in jail : conteneurisez vos traitements data sans serveur","toTime":"2018-11-20 18:00","track":"Data","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 10:00","id":"cc-1ade9p7earafenmj4bfskpv926","room":"Salon d'Honneur","speakers":[{"id":"hlebretc1a763a621b54e6a87ef3bb653ade950","name":"Hugues Le Bret"}],"summary":"**Bio**\nAncien proche de Daniel Bouton, ex-PDG de Boursorama, (filiale de la Société Générale), Hughes Le Bret a été directeur de la communication du groupe bancaire durant dix ans et notamment lorsque l'affaire Kerviel éclata.  De cette expérience, Hugues Le Bret a écrit un livre, « La semaine où Kerviel a failli faire sauter le système financier mondial ».\n\n\nHugues Le Bret a démissionné du poste de PDG de Boursorama le 03/10/2010 pour créer en 2012 l'une des Fintech européennes les plus en vue : Compte Nickel, le compte bancaire en ligne sans banque, qui sera racheté par le groupe BNP PARIBAS en 2017. ","title":"Tech4Exec - Quelles options de sortie pour les Fintech ?","toTime":"2018-11-20 10:45","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 11:10","id":"cc-55sp824kout5df8u3s63l3rbks","room":"Salon d'Honneur","speakers":[{"id":"afrenove257ef2960ff847ae8766e59e43c8b228","name":"Anne-Sophie Frenove"},{"id":"eflahaultfranc6b5a712a2cf54881b805b1a61675901f","name":"Emmanuelle Flahault-Franc"}],"summary":"** Bio de Anne Sophie Frenove **\nAnne-Sophie Frenove est une passionnée de la Tech et de tout ce qui va changer le monde de demain. Passée par San Francisco, Londres, Dublin puis Paris, elle a travaillé chez Samsung, HTC et désormais contribue depuis 2014 à l'accélération de la croissance chez Airbnb pour l'Europe. \n\nEmmanuelle Flahault-Franc et Anne-Sophie Frenove se sont rencontrées chez Airbnb en 2014 et ont créé un club où entrepreneurs et dirigeants de start-up partagent sans filtre leurs difficultés et leurs conseils. L’écriture de cet ouvrage \"Into the French Tech\" est le fruit de ces échanges et de longs entretiens avec 50 fondateurs de start-up. \n\n\n\n** Bio d'Emmanuelle Flahualt Franc **\nEmmanuelle a rejoint en 2017 Iris Capital en qualité de directrice de la communication et du marketing. Avant de rejoindre Iris Capital, Emmanuelle a travaillé chez BFM BUSINESS où elle a lancé et produit des conférences, cercles d’influenceurs et programmes TV. Auparavant, elle a été Responsable communications chez Google, en charge des relations publiques et des événements pour YouTube, Android, les programmes développeurs et la stratégie commerciale. Elle a ensuite rejoint Ubisoft où sa mission consistait à amplifier les événements internationaux auxquels Ubisoft participait auprès de ses communautés et partenaires. \n\nElle a également été en charge de la communication d’Airbnb en Europe du Sud et francophone. Emmanuelle Flahault-Franc et Anne-Sophie Frenove se sont rencontrées chez Airbnb en 2014 et ont créé un club où entrepreneurs et dirigeants de start-up partagent sans filtre leurs difficultés et leurs conseils. L’écriture de cet ouvrage est le fruit de ces échanges et de longs entretiens avec 50 fondateurs de start-up. ","title":"Tech4Exec - \"Into The French Tech\": les coulisses de l'aventure entrepreneuriale des 50 startups françaises les plus influentes","toTime":"2018-11-20 11:55","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 12:05","id":"cc-4vtkl7r326o2botkrvebiv3t6b","room":"Salon d'Honneur","speakers":[{"id":"jlalanne1437c8299b204438b5cefe2024938d68","name":"Jean-Christophe Lalanne"}],"summary":"** Bio de Jean-Christophe Lalanne **\n\nIngénieur de télécommunications, Jean-Christophe Lalanne réalise l’ensemble de son parcours professionnel dans le domaine des technologies de l’information. Il entame sa carrière au sein du groupe Alcatel et de Sema Group, en assurant de nombreuses missions dans le domaine de l’architecture et des technologies des systèmes d’information.\nSuite au rapprochement d’Ernst &amp; Young avec Cap Gemini en 2000, Jean-Christophe Lalanne occupe plusieurs fonctions exécutives au sein de Cap Gemini France.                          Il œuvre au sein de la compagnie aérienne Air France depuis 2004. À son arrivée, il se charge de la direction de la stratégie informatique et participe au rapprochement des systèmes d’information d’Air France et de la compagnie néerlandaise KLM.                 Succédant à Edouard Odier, en 2012, il est nommé au poste de directeur général adjoint systèmes d’information d'Air France et d’Air France-KLM et intègre, à ce titre, le comité exécutif du groupe Air France-KLM.  Depuis 2016, il est Vice-Président du CIGREF.","title":"Tech4Exec - DSI Business and Digital driven","toTime":"2018-11-20 12:50","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 14:15","id":"cc-6h9bn9a889l8viit1jdivjsffb","room":"Salon d'Honneur","speakers":[{"id":"abensoussan580399bf3901408a9f6a548efaace134","name":"Alain Bensoussan"}],"summary":"**Bio d'Alain Bensoussan **\nAvocat à la Cour d’appel de Paris, précurseur du droit des technologies avancées, Alain Bensoussan a fait de l’élaboration de concepts nouveaux l’une de ses marques de fabrique : domicile virtuel, droits de l’homme numérique, vie privée résiduelle, etc. En 2012, après avoir créé Lexingâ, premier réseau international qui fédère des avocats en droit du numérique et des technologies avancées, il lance au sein de son cabinet un département sur le droit des technologies robotiques, y voyant « la reconnaissance par le droit d’une mutation technologique au moins aussi importante que l’ont été l’informatique et les réseaux sociaux au 20e siècle ». \n\nAux yeux de cet infatigable explorateur de nouveaux domaines du monde numérique, il était temps de créer un droit des robots les dotant d’une personnalité et d’une identité juridique pour en faire, demain, des sujets de droit : « Avec l’introduction d’une intelligence artificielle, les robots ne sont pas de simples automates. Ils ont des capacités grandissantes qui les amènent à collaborer avec les hommes ». Alain Bensoussan est également président et fondateur de l’Association du droit des robots (ADDR).  Spécialiste reconnu du droit des données à caractère personnel, il est l'auteur du premier ouvrage entièrement dédié au Réglement général sur la protection des données (RGPD), paru en octobre 2016 chez Larcier (2ème édition: décembre 2017, dont une version en anglais a été publiée au printemps 2017 chez Wolters Kluwer.","title":"Tech4Exec - Le RGPD, 6 mois plus tard.","toTime":"2018-11-20 15:00","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 15:10","id":"cc-7i68oj7c8vh9pptikbeapegkqn","room":"Salon d'Honneur","speakers":[{"id":"bkevin1753094dbbe747f58db1f28e92d08a56","name":"Bruyère Kevin"},{"id":"mphilippe845581adb6c249a28eb14bd0fad4c8ab","name":"Morère Philippe"}],"summary":"Par Kevin Bruyère, Global Head of MACC\net Philippe Morere, Global CIO","title":"Tech4Exec - Transformation à l’échelle au sein de la Banque de Grande Clientèle et Solutions Investisseurs","toTime":"2018-11-20 15:55","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 16:20","id":"cc-09onnrg28334umigmoc2btcibt","room":"Salon d'Honneur","speakers":[{"id":"jharttung3fd18a471a5b4ef49674f41214b93e91","name":"Jakob Harttung"}],"summary":"** Bio de Jakob Harttung ** \nJakob Harttung, diplômé de l'École polytechnique et de Telecom Paris en 1993, a démarré sa carrière chez Mc Kinsey pour rejoindre Microsoft où il occupé pendant plus de 10 ans plusieurs fonctions dans la stratégie commerciale et la responsabilité du pôle stratégie plateforme et évangélisme technique . \n\nIl rejoint EDF en 2015 en qualité de Directeur du Département numérique et  depuis 2017 il occupe les fonctions de Directeur du Digital des affaires industrielles chez Sanofi.","title":"Tech4Exec - Le Big Data au service de l'Industrie 4.0","toTime":"2018-11-20 17:05","type":"Talk"},{"conferenceId":"cc-20181120","fromTime":"2018-11-20 17:15","id":"cc-50m94k69j00gkporuo9j6oitnt","room":"Salon d'Honneur","speakers":[{"id":"dreinertsen4f1e497f1d5547c09826894532914063","name":"Don Reinertsen"}],"summary":"Don Reneirstein is the President of Reinertsen &amp; Associates, a consulting firm specialized in the management of product development. He has worked with leading product development organizations for over 30 years, and taught executive courses at Caltech for 14 years. \n\nHe is the author/co-author of three best-selling books on product development, and is considered one of the leading thinkers in the field of lean product development. \nHis latest awarding winning book, The Principles of Product Development Flow: Second Generation Lean Product Development, has been praised as, “… quite simply the most advanced product development book you can buy.”.","title":"Tech4Exec - What Do We Want from Systems Thinking?","toTime":"2018-11-20 18:00","type":"Talk"}]