[{"conferenceId":"cc-20181018","fromTime":"2018-10-18 14:00","id":"cc-6s3aphptt6m62tovoijhidsv6b","room":"3e - Salle de vie","speakers":[],"title":"Questions - Réponses","toTime":"2018-10-18 18:00","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 14:00","id":"cc-4utj29riqva9c8140hluqat8ou","room":"7e - Eiffel","speakers":[{"id":"vsegouin","name":"Vincent Segouin"}],"summary":"**Pitch**\nCe slot a pour objectif de revenir sur ce qui a été réalisé en terme de sécurité des données enregistrées sur une blockchain privée lors du projet blockchain pour le compte d'Europ-Assistance.\n\nOn va parler de KMS, OTP et RSA et expliquer leurs fonctionnements en faisant écho au slot de Septembre sur Hyperledger Fabric (il n'est pas nécéssaire d'avoir suivi ce dernier slot pour suivre celui ci)\n\nDe plus le but n'est pas de faire un état de l'art dans ces 3 domaines mais de montrer ce qui a été réalisé ainsi le cheminement qui a été fait pour arriver a ce résultat et eventuellement débattre sur les autres options qui auraient pu être choisis.\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nAucun\n\n**Logistique**\nRien de particulier","title":"[MedChain] Chiffrement end-to-end sur AWS à l'aide de KMS","toTime":"2018-10-18 14:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 14:00","id":"cc-3r2aj6vjfu6mfahn6fd9obmra7","room":"7e - Haussmann","speakers":[{"id":"rsagean","name":"Romain Sagean"}],"summary":"**Pitch**\nEn octobre c'est dataviz. Pour cette année je vous propose un Hands On sur D3.js. Au programme présentation de l'API et mise en pratique sur tarte et barre chocolaté.\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nConnaissance de base en TypeScript\n\n**Logistique**\nPC avec navigateur","title":"Hands On - D3.js","toTime":"2018-10-18 15:55","type":"Hands'On"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 16:00","id":"cc-4abrk73imdpio2i8v2ob4ug6hh","room":"7e - Haussmann","speakers":[{"id":"achotard","name":"Alexis Chotard"}],"summary":"## Pitch\nLe Paris Container Day s'est tenu en juin dernier. Venez découvrir lors de ce slot les résultats de la rétrospective sur cette édition, les enseignements tirés du feedback des participants ainsi que diverses statistiques sur les ventes de billet, le bilan financier, etc. Et bien sûr, les adaptations pour l'édition 2019 qui découlent de tout ceci.\n\nUne occasion parfaite de découvrir l'envers du décor de l'organisation d'un évènement chez Xebia, en toute transparence !\n\n## Comment\n\nAucune idée de ce qu'est cette section !\n\n## PrérequisAucun :)","title":"Paris Container Day : Rétrospective 2018 et ambitions 2019","toTime":"2018-10-18 16:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 17:00","id":"cc-4r3btqjbrte3p1k8dmvrplj3if","room":"7e - Haussmann","speakers":[{"id":"jdatour","name":"Julien Datour"},{"id":"scivetta","name":"Simone Civetta"}],"summary":"\n**Pitch**\nVenez tester vos connaissances en Swift et faire chauffer vos neurones, pas ceux de votre device cette fois-ci, en vous confrontant à un quizz tordu et plein d'exotisme que nous avions joué pendant la FrenchKit ...\n\n**Pré-requis**\nUn niveau acceptable en Swift","title":"Swizz in my pants","toTime":"2018-10-18 17:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 15:00","id":"cc-66v0qatrneocrv9qcip14he7ih","room":"7e - Monceau","speakers":[{"id":"ndechandon","name":"Nicolas Dechandon"},{"id":"jnorblin","name":"Jonathan Norblin"}],"summary":"**Pitch**\nOn écrit tous des scripts shell sur nos missions. Alors stop au copié/collé depuis google.\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nAucun\n\n**Logistique**\nRien","title":"Clean shell","toTime":"2018-10-18 15:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 16:00","id":"cc-344dlid27vaujqhnt0731gpacr","room":"7e - Monceau","speakers":[{"id":"sbuisson","name":"Sarah Buisson"}],"summary":"**Pitch**\nEt si le cerveau humain utilisait un algorithme pour la reconnaissance visuelle ?  Explication et comparaison entre le fonctionnement biologique et numérique\n\nSujet pour la Xebicon\n\n**Niveau**\nDébutant\n\n**Pré-requist**\nAucune.\n\n**Logistique**\nProjecteur, un qui fait une image net, si possible pas celui de la salle eiffel","title":"L'algorithme de reconaissance de forme du cerveau humain","toTime":"2018-10-18 16:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 14:00","id":"cc-36v7n9f3vn0utsvfq64bj36v6e","room":"7e - Monceau","speakers":[{"id":"mohayon","name":"Michael Ohayon"}],"summary":"**Pitch**\nIl est difficile de recruter sur Android, comment savoir le vrai niveau d'un candidat ?\nGoogle propose des formations via Udacity.\nCes formations délivrent des certificats, parfois mis en avant par certains candidats.\nParlons de leur validité et observons ensemble le format des cours et exercices de la formation Android Udacity !\n\nSi vous n'avez aucune connaissance en Android et que vous souhaitez enrichir votre périmètre, vous êtes au bon endroit !\n\nCe slot se déroulera en trois temps :\n- Retour sur quelques pépites du recrutement chez un de nos clients pour bien comprendre la problématique des différents niveaux techniques sur Android.\n- Retour sur notre partenariat avec Google et analyse des deux formats proposés (Android Nanodegree et Android Associate Developer).\n- Présentation de la plateforme Udacity, consultation des sujets de cours et exercices\n- Quels sont mes critères pour l'évaluation d'un candidat ?\n\n\n**Niveau**\ndébutant\n \n**Pré-requis**\naucun\n \n**Logistique**","title":"Recrutement & Tech - Que valent vraiment les formations et certifications officielles Android ?","toTime":"2018-10-18 14:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 17:30","id":"cc-6d39atoiuf67up9c26iao5hq4j","room":"7e - Monceau","speakers":[{"id":"gbianchi","name":"Giulia Bianchi"}],"summary":"**Pitch**\nDepuis son arrivée, GCP a démocratisé la conception et la mise en place de services basés sur l'IA sans avoir besoin en pré-requis de connaissances spécifiques en IA. Typiquement avec Dialogflow pour la création d'un chatbot personnalisé ce qui compte est le savoir-faire du développeur qui va mettre en place et intégrer le pipeline complet pour l'exposition du service. Comment un Data Scientist peut-il s'orienter dans ce monde qui n'est pas le sien pour apporter de la valeur aux projets utilisant tout le potentiel de GCP ?\n\n**Note**\nRépétition du talk que je vais donner à DevFest Toulouse. Le format de la conférence est un lighting talk de 15 minutes sans questions.","title":"GCP pour les Data Scientists","toTime":"2018-10-18 17:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 17:00","id":"cc-1o0pp9ct7or50qldpmgkm3ufmu","room":"7e - Monceau","speakers":[{"id":"ldivad","name":"Loic Divad"}],"summary":"**Pitch**\nL’Auto Scaling c’est l’argument phare d’un bon nombre de technologies en Data Engineering. Parmi les outils du moment on retrouve Kafka-Streams. Avec sa forte intégration au bus de message Apache Kafka il est pensé pour être un framework distribué capable de passer à l’échelle. Pourtant dans la pratique sa seul utilisation est limitée. L’orchestration de ces applications seront généralement nécessaire. \n\nKafka-Stream est un framework vraiment pensé pour scaler alors que va-t-il manquer exactement? Ce talk présente la conteneurisation, l’orchestration, le monitoring et le tracing comme les éléments clefs qui permettront de profiter pleinement de la scalabilité de notre application de Steam Processing. \n\n**Niveau**\nTous niveaux\n\n**Pré-requis**\n- Première notions de Kafka\n- Première notions de Kubernetes \n\n**Logistique**\n- Aucun\n- Note: répétition Xebicon","title":" Scale Up and Down with Kafka-Streams and Kubernetes.","toTime":"2018-10-18 17:25","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 09:30","id":"cc-7u7h2u2ol6coehum5hg55tt398","kind":"keynote","room":"7e - Monceau","speakers":[{"id":"llegardeur","name":"Luc Legardeur"}],"title":"Plénière - Luc","toTime":"2018-10-18 10:00","type":"keynote"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 12:05","id":"cc-2e2eeuoni11j0ubb59gdm5ovut","kind":"keynote","room":"7e - Monceau","speakers":[],"summary":"1 salade par personne\n1 quiche par personne\n1 part de gâteaux par personne ","title":"Déjeuner","toTime":"2018-10-18 13:00","type":"keynote"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 14:00","id":"cc-2b62h4oelp6990oo5ad3fft3nh","room":"7e - Montmartre","speakers":[{"id":"esciara","name":"Emmanuel Sciara"},{"id":"omarquet","name":"Olivier Marquet"},{"id":"fcourdier","name":"Frédéric Courdier"}],"summary":"**Pitch**\nSouvent dans nos missions on nous demande de gérer un niveau Portfolio ou Feature avec Jira pour un produit avec plusieurs équipes. Ce hands-on a pour but de découvrir le plugin Structure de Jira permettant de modéliser le niveau Portfolio, le suivi des Releases et des PI. Vous aurez aussi accès à Jira Portfolio et Big Picture pour comparer. Ainsi qu’aux plugins Script Runner et Automation. \n \n**Niveau**\nCoach agile ou être concerné par les problématiques d'agilité à l'échelle et par le déploiement d'outils de gestion de backlog à l'échelle.\n \n**Pré-requis**\nnéant\n \n**Logistique**\n néant","title":"Hands-On - Agilité à l'échelle sur JIRA & Structure (portfolio)","toTime":"2018-10-18 15:55","type":"Talk"},{"conferenceId":"cc-20181018","fromTime":"2018-10-18 16:00","id":"cc-7jg9ett41klk9m8c24t29u7ga2","room":"7e - Montmartre","speakers":[{"id":"lbigot","name":"Loic Bigot"},{"id":"dortega","name":"Diana Ortega"}],"summary":"**Pitch**\nQu'est-ce que le Cloud ? Quels sont les acteurs ? Comment choisir mon fournisseur ? Peut-on les comparer?\n\nPrenons le rôle d'une personne qui ne connais pas le cloud, en tant qu'utilisateur. Quelle démarche avons nous adoptée pour faire un tour d'horizon? Quelle sont les différents services que les fournisseurs nous propose pour remplacer mon architecture on-premise\n \nCette présentation a été préparée et jouée pour la formation Coding Architect qui a eu lieu début octobre 2018.\n\n**Niveau**\nmoyen\n\n**Pré-requis**\nAucun\n \n**Logistique**\nProjecteur","title":"Coding Architect - Cloud","toTime":"2018-10-18 17:25","type":"Talk"}]