[{"conferenceId":"cc-20190627","fromTime":"2019-06-27 08:15","id":"cc-5slub93l4pm1248popaksk4ge0","kind":"keynote","speakers":[],"summary":"Retrouvons nous dans le \"Hall Admin\" pour l'accueil du matin","title":"Accueil des participants - Café de bienvenue","toTime":"2019-06-27 08:45","type":"opening"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 08:45","id":"cc-00hq388v99m5206bfsr4qgv1a5","kind":"keynote","speakers":[],"summary":"Le mot des organisateurs se déroulera dans l'Amphi 1 / Amphi 2","title":"Mot des organisateurs","toTime":"2019-06-27 09:00","type":"opening"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:00","id":"cc-4mqi7ttulppqbr7telpg2glpl4","kind":"keynote","speakers":[{"id":"slebaileb8f5c30f20746b2ab9cd8235cb06822","name":"Sylvie LE BAIL"}],"summary":"\nSylvie Le Bail - Amphi 1 / Amphi 2\n\nVous est-il déjà arrivé de parler du sens de la vie avec un chaman ? Vous pourriez être surpris de sa réponse car pour un chaman cette question n’a pas de sens.  Il ne la comprend pas et il ne comprend pas non plus comment nous pouvons nous la poser. Pour eux, être est le sens. Il n’y a rien d’autre.\n \nEt si cette question du sens qui nous taraude parfois, n’était que la conséquence de schémas mentaux dans lesquels nous nous sommes enfermés ? des schémas dans lesquels, trop occupé à faire, nous oublions d’être ?  des schémas qui nous coupent d’une réalité dans laquelle, pour reprendre les mots des amérindiens Lakotas « Mitakuyé Oyasin » c’est-à-dire « Tout Est Relié ».  Une réalité où nous avons peut-être plus à être attentif à la résonance que les situations provoquent en nous, qu’à trouver des solutions, à résoudre des problèmes ?\n \nLa question du sens pourrait mettre nos sens en émoi. En tous les cas, elle nous invite peut-être à compléter notre vision du monde.","title":" Keynote 1 : La question du sens, une opportunité à compléter notre vision du monde ?","toTime":"2019-06-27 09:45","type":"keynote"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 10:45","id":"cc-56g33k1ue68fm8r2v3mg0tie37","kind":"keynote","speakers":[],"summary":"Pour un petit moment de convivialité durant l'encas du matin, c'est direction le \"Hall Admin\"","title":"Encas du matin","toTime":"2019-06-27 11:10","type":"break"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 12:00","id":"cc-7gk5lj59bfb7pqri7ce5s9gnt8","kind":"keynote","speakers":[],"summary":"Pour la pause déjeuner, retrouvons nous au RU","title":"Pause déjeuner","toTime":"2019-06-27 13:30","type":"lunch"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 13:30","id":"cc-435h9lodvcklisnav17tbv4m8o","kind":"keynote","speakers":[{"id":"pbaudimontea9e186f6c8e41459af25ac309d665b8","name":"Perrine BAUDIMONT"},{"id":"severs0267f50639fe418794ca069c82931f3a","name":"Steeve EVERS"},{"id":"droquel4510ecd8bec147ed96479117d91645e3","name":"Damien ROQUEL"}],"summary":"\nPerrine Baudimont, Damien Roquel et Steeve Evers - Amphi 1 / Amphi 2\n\n\n« Il y a quelques mois à la fin de ma conférence \"L'école forme-t-elle à l'Agilité\" lors d'Agile Tour Nantes je me posais la question de ce que chacun pouvait faire à son échelle pour développer l'apprentissage de la collaboration dès le plus jeune âge. Voici le premier résultat concret : avec deux \"collègues\" Steeve Evers et Perrine Baudimont, nous avons eu envie de créer du lien entre le monde de l'entreprise que nous connaissons bien et celui de l'enseignement,  que nous avons vécu en tant qu'apprenants et que nous redécouvrons avec un regard de parents.» Damien Roquel.Ainsi est né notre projet : créer un espace de rencontre et de partage avec ceux et celles qui forment les adultes de demain : les enseignantes et enseignants. La première rencontre a eu lieu, avec 14 personnes du monde de l’éducation (de la maternelle à l’université) à Téloché les 18 et 19 février. Et comme le disait l’une des enseignantes à l’issue de ce moment partagé : « c’était ouf ! ».","title":"Keynote 2 : Nous sommes le système","toTime":"2019-06-27 14:15","type":"keynote"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:15","id":"cc-58r23f5t0qcpb6r36a68huh080","kind":"keynote","speakers":[],"summary":"Pour la pause café, c'est rendez vous dans le \"Hall Admin\"","title":"Pause café","toTime":"2019-06-27 15:30","type":"break"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 16:30","id":"cc-44kejb5clrihgbl1ba23tp0esu","kind":"keynote","speakers":[],"summary":"Afin de clôturer cette journée, retrouvons nous tous ensemble dans les \"Amphi 1 / Amphi 2\"","title":"Mot de clôture","toTime":"2019-06-27 17:00","type":"closing"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:55","id":"cc-50ej3forlt4dk11ib3aads2dcf","room":"Amphi 1","speakers":[{"id":"jlambert26a9d899f3ac41279663060e27ad562a","name":"Jean-Luc LAMBERT"}],"summary":"Voir l'agilité sous l'angle de la pragmatique de la communication et découvrir pourquoi et comment cela marche ! Je vous invite à la découverte de l'œuvre de Paul Watzlawick et à comprendre pourquoi changer une organisation, c'est d'abord une affaire de communication !","title":"L'agilité, finalement, c'est que de la communication !","toTime":"2019-06-27 10:45","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 11:10","id":"cc-5oh5r2nkm7p9kjbav353o5c5qd","room":"Amphi 1","speakers":[{"id":"cbodine198f6cf4c7b4553b048d1a9b3cc0e8b","name":"Cédric BODIN"}],"summary":"On dit que le management c'est de la pédagogie pour adultes, et la pédagogie c'est du management pour enfants.\u2028\nAussi, faites confiance à l'humour décapant des personnages de la série Malcolm in the Middle pour vous en apprendre beaucoup sur le Middle management dans LE contexte agile par excellence : la famille !\u2028\nNous aborderons ensemble plusieurs leçons fondamentales sur le management, où chaque réflexion sera illustrée par des extraits de la série, et transposée au contexte professionnel en s'appuyant sur mes retours d'expérience en coaching agile.\u2028\nBref, une session 100% vidéo-ludique ;)\n\n#rex","title":"Malcolm in the Middle management","toTime":"2019-06-27 12:00","type":"REX"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 14:25","id":"cc-4lk41scvfgob7v57o3vlqn6fll","room":"Amphi 1","speakers":[{"id":"tliud89299532e9943c3b82b04aeb702c6bb","name":"Tianxiao LIU"}],"summary":"\nIl s’agit d’un retour d’expériences de 9 ans d’enseignement en gestion de projet agile en Licence et Master d’informatique à l’université. L’idée principale est de réduire grandement, voire effacer l’écart entre les connaissances / compétences en agilité acquises à l’université et les vraies exigences des entreprises. Partant d’un niveau débutant, les étudiants progressent considérablement chaque année grâce à cet enseignement. Ils deviennent opérationnels, avec des capacités techniques et en management, dans les projets agiles d’entreprise, à l’issue de notre formation, ou même pendant la formation : stage et alternance en entreprise. L’enseignement est réalisé autour de plusieurs UE (Unité d’Enseignement) réparties en 4 ans (de Licence 2e année à Master 2e année). Chaque UE est composée d’une partie théorique et d’un projet à réaliser / gérer en équipe (3-6 étudiants selon l’année et l’UE). On considère bien le niveau et la capacité des étudiants en chaque année universitaire, afin de leur demander un travail adapté à leurs perspectives. On pratique des pédagogies actives telles que l’apprentissage par problème, par projet et par programmation. Tout cela est mené par des activités pédagogiques collectives permettant aux étudiants d’acquérir les compétences progressivement dans de vrais contextes.\n\n#rex","title":"Enseigner la gestion de projet agile à l’université : une approche progressive et adaptée à l’industrie","toTime":"2019-06-27 15:15","type":"REX"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:30","id":"cc-607ckiqugkrssgdhdp7fju30rn","room":"Amphi 1","speakers":[{"id":"sbachelet4f966e390b474286947ddc4379e35e0d","name":"Stéphane BACHELET"}],"summary":"\nAvez-vous déjà pratiqué les estimations sur un projet Agile ? Si tel n’est pas le cas, je montrerai ce qui est estimé dans un projet Agile, qui est responsable de ces estimations en illustrant ce propos au travers d’un exemple concret tiré de notre vie courante. Je vous montrerai également quelques techniques d’estimation vous permettant de sortir de cette présentation avec la possibilité de mettre en places ces techniques dans votre contexte. Si les estimations sont votre quotidien, j’aimerai vous amener à réfléchir sur la pertinence de ces estimations et vous proposer des solutions pratiques et simples pour débuter et appliquer #NoEstimates sans pour autant perdre les indicateurs d’avancement apportés par ces estimations mais en générant plus de conversations et d'interactions entre les membres d’une équipe.\n\n#rex","title":"Estimates or #NoEstimates… Telle est la question ?","toTime":"2019-06-27 16:20","type":"REX"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:55","id":"cc-1tj9b00mgamivr1r9559lr5m60","room":"Salle 2 - TC","speakers":[{"id":"clavierf87e20e31ea34beda9b74353c11c8ce3","name":" Thomas CLAVIER"},{"id":"abenoist375a9e5a42974c79a1aeceae678c5808","name":"Alexis BENOIST"}],"summary":"Hôte ou hôtesse, personne qui donne l’hospitalité … Et si l’analogie de l’hôte nous donnait les moyens d’êtres tous leaders ? D’ailleurs, n’avons-nous jamais été leader en organisant une fête ou une soirée ? Cette conférence atelier vous emportera dans une expérience nouvelle du leadership. Vous en repartirez avec un outil riche et puissant capable de révéler le leader qui sommeille en vous. Cette session est ouverte à tous, et aucune compétence particulière n’est nécessaire pour l’apprécier à sa juste valeur.","title":"Host leadership, la métaphore de l’hôte au service du leadership ","toTime":"2019-06-27 10:45","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 11:10","id":"cc-7cf8789kp0kuj6t89dm11cbmdn","room":"Salle 2 - TC","speakers":[{"id":"mvivier3d6af57b59ea4f369ee0ee73d5bc27fb","name":"Maïwenn VIVIER"},{"id":"sbeaussant57a6249826cd496897601a14a0f41f13","name":"Suzon  BEAUSSANT"}],"summary":"Innover n’est pas anodin, échouer non plus ! La peur de l’échec paralyse bien souvent : plutôt que d’oser, parfois, on préfére attendre, oublier, différer, voire renoncer. Pourtant, l’échec a ses vertus que la raison ne connaît pas, ou pas assez : apprendre plus vite, comprendre mieux, écouter notre intuition, nous affirmer, nous découvrir, faire épreuve d’humilité, d’audace, se sentir vibrer et bien en vie, quand on rebondit. Alors on vous propose de vivre une conférence particip'active pour explorer ensemble (parce que ça fait moins peur ^^) la notion d'échec, à la lumière des expériences de chacun. Notre parti pris : remettre l'échec à sa juste place, en se jouant de nos propres erreurs…","title":"Soyez confiant·e·s : plantez-vous !","toTime":"2019-06-27 12:00","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 14:25","id":"cc-3qn6furic90eoppinq72tr6kva","room":"Salle 2 - TC","speakers":[{"id":"cswierkowski5ee7ffc5a3c44f0997baa9baef577093","name":"Céline SWIERKOWSKI"}],"summary":"Aujourd’hui, nous sommes nombreux à travailler au sein d’une équipe, quelque soit notre domaine d’activité. Depuis plus de 15 ans, c’est mon cas…J’y ai vécu des expériences enrichissantes, et quand toute l’équipe se fait confiance, nous y sommes alors tous bien plus efficaces…et épanouis ! Allez, avouons-le….j’y ai aussi rencontré des (petits) moments de solitude et d’incompréhension : silence, malaise, langue de bois, désengagement, conflit, etc. En tant qu’équipe, avions-nous seulement pensé à vérifier auprès de chacun que nous étions dans des conditions de relation « sûres » pour se sentir libre de s’exprimer ? Chacun a ses raisons d’être mal à l’aise dans un groupe, nous en soupçonnons certaines, mais d’autres sont parfois tellement peu explicites que nous passons à côté. Lors de cet atelier, je vous invite à comprendre : - Comment vérifier et parler demain du sentiment de sécurité ou d’insécurité de chacun, - Comment poser les 1° briques pour l’amélioration de ce sentiment de sécurité. Votre équipe pourra alors s’ouvrir vers de nouveaux horizons, agile ou pas, en tout cas en toute confiance et en toute sécurité\n\n#workshop","title":"Le changement, c'est...en toute sécurité ! (30 personnes max)","toTime":"2019-06-27 15:15","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:30","id":"cc-6dtab6183vj7n1dtvdctldej55","room":"Salle 2 - TC","speakers":[{"id":"sretiere55b727b60b0c4186ad5b4d3343fabe68","name":"Samuel RETIERE"}],"summary":"On peut voir le changement comme une transformation, accumuler du software avant de le montrer, attendre une réunion d'amélioration pour s'améliorer, se dire qu'il faut clarifier des rôles et responsabilités,... ou voir le changement comme une évolution, prendre du feedback au fil de l'eau, fluidifier autant le système que le travail en cours, adapter les activités au contexte,... Si des pratiques agiles comme Scrum ont apporté plus de prises en compte de l'utilisateur, elles ont amené une certaine normalisation et elles n'ont que peu fait bouger les lignes de pouvoir. Au fur et à mesure, nous nous sommes aussi éloignés du développement logiciel. Culture flow, c'est mettre le système sous tension et lui donner la capacité d'évoluer de manière plus dynamique tant au niveau produit, qu'organisationnel et technique. Dans cette session, je vous propose de présenter les principes et un peu les pratiques qui se cachent derrière le Flow. Pour faciliter la lecture, je les déclinerai avec 5 axes de lecture : Le produit, l'organisation, l'excellence technique, le leadership et les méthodes de travail.","title":"Culture flow","toTime":"2019-06-27 16:20","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:55","id":"cc-12n3rher8vtp2fe6lmd47vogaf","room":"Salle 3 - TC","speakers":[{"id":"severs0267f50639fe418794ca069c82931f3a","name":"Steeve EVERS"}],"summary":"\nAprès la phase expérimentale (le projet Aristote), je vous propose un atelier où vous découvrirez le manifeste de l'apprenant, 8 principes nous permettant de devenir un meilleur coach, enseignant, parent, formateur, facilitateur, bref, un meilleur \"passeur d'information\". Cet atelier sera surtout une \"démonstration\" dans le sens où vous apprendrez ces principes en les mettant en oeuvre. Venez bénéficier de cette mini formation et repartez avec des outils/pratiques à mettre en œuvre ainsi qu'un modèle de déroulé pour vos prochaines formations/interventions/enseignements.\n\n#workshop","title":"Du projet Aristote au manifeste apprenant (max : 30 personnes)","toTime":"2019-06-27 10:45","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 11:10","id":"cc-2jseuuue8c22o6t577c0im20v9","room":"Salle 3 - TC","speakers":[{"id":"ddesfougeres5c75869fbba14ee890d7d06f65a89dad","name":"David DESFOUGERES"}],"summary":"Vous avez peut être lu \"Reinventing Organization\" de Frédéric Laloux, son analyse se base sur la \"Spirale Dynamique\".\nC'est une théorie qui démontre que l'humanité, les individus et les organisation suivent les mêmes cycles d'évolutions (son autre nom \"La Théorie de l’Emergence Cyclique des Niveaux d’Existence\")\nElle est utilisé autant comme base de thérapie par des praticiens de la santé, en politique (Nelson Mandela l'a utilisé lors de la sortie de l’apartheid), ou encore en coaching car elle est une grille de lecture des valeurs d'un individu ou d'un groupe.\nPuisque l'agilité s'intéresse aux individus et à leurs interactions,  j'ai décliné cette théorie sur l'agilité pour créer ce que j'ai appelé la \"Spirale Agile\".","title":"La Spirale Agile ","toTime":"2019-06-27 12:00","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 14:25","id":"cc-4sh4318sgu3eg0tfj7b9rkqfqr","room":"Salle 3 - TC","speakers":[{"id":"rschneidere3f5618fea584a2db4fadc41ff74df66","name":"Régis SCHNEIDER"}],"summary":"\nLes jeux Agile sont un moyen très intéressant pour aider les acteurs qui s’engagent (que l’on engage…) dans une démarche Agile. Nous en expérimenterons quelques uns axés autour des postures managériales. Je vous propose des activités que vous pourrez à votre tour proposer dans votre propre organisation dès le lendemain...\n\n#workshop","title":"Appréhender des postures managériales en contexte Agile (30 personnes max)","toTime":"2019-06-27 15:15","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:30","id":"cc-568gveq2p9euomaifjjmdb4ml2","room":"Salle 3 - TC","speakers":[{"id":"hheas81c5199dd2c94d108e1a26d668307522","name":"Herri HEAS"},{"id":"srevereault8ab35325881f443e8023644eda905e35","name":"Sylvain REVEREAULT"}],"summary":"Depuis 2 ans et demi, au sein de l'agence Zenika Rennes, nous avons fait le choix d'expérimenter un management mettant nos consultants au centre de la prise de décision.\nPas facile de lâcher prise sur un sujet aussi important, de s'aventurer en terre inconnue, de concilier performance et co-décision, mais nous avons persévéré.\n\nNous vous proposons un retour d'expérience sur nos apprentissages, sur nos pratiques, sur nos outils... et sur nos frissons.\n\n#rex","title":"La co-décision : on a mis 2 mois à choisir une cafetière, et c’est génial !","toTime":"2019-06-27 16:20","type":"REX"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:55","id":"cc-1sn9gl6uasnf19cbn5jduqkk2i","room":"Salle 4 - TC","speakers":[{"id":"jtheaud32c4cf3455d54ff999bfe8e053e9772b","name":"Julien THEAUD"},{"id":"edupontf2cbf07e4e9544478f09a402f2443d78","name":"Eric DUPONT"}],"summary":"Vous avez vécu une expérience Agile avec une équipe et êtes curieux de voir comment se synchroniserait plusieurs équipes.\n Vous avez parcouru la littérature sur SAFe et aimeriez vivre l’expérience d’un PI Planning.\n Nous vous proposons de prendre un peu de votre temps pour dérouler sous la forme d’une simulation d’un PI planning\n\n#workshop","title":"Embarquez à bord d’un PI planning (max : 30 personnes)","toTime":"2019-06-27 10:45","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 11:10","id":"cc-5022nke3q6lc7tj7mso6q8eknm","room":"Salle 4 - TC","speakers":[{"id":"mriboulet8a8e1d006d3342b588b9f93fe58c6e43","name":"Matthieu RIBOULET"}],"summary":" L’agilité est devenue la coqueluche des acteurs de l’économie traditionnelle à la recherche d’un second souffle face à l’invasion des nouveaux barbares. Tous veulent être agile de la tête au pied mais leurs vieilles habitudes ont du mal à disparaitre au point qu’ils s’appuient sur des modèles prédéfinis « car un cadre s’est rassurant ». Le temps d’une conférence, nous allons remettre en cause ces croyances. Après un bref rappel des différents modèles et de leurs spécificités permettant de faire de l’agilité à l’échelle, nous prendrons le temps de comprendre pourquoi le principal modèle a tant de succès et pourquoi Startups et Acteurs de l’économie traditionnelle ne mettent pas la même chose derrière le terme agilité. Enfin, nous verrons comment, dans la réalité de ces « vieilles » entreprises, il est possible de s’approcher de l’agilité des startups en parlant le seul langage qu’elles comprennent: le langage des risques.","title":"Faire de l'agilité à l'échelle de l'entreprise","toTime":"2019-06-27 12:00","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 14:25","id":"cc-6b66s92dfsikkraov1v2msgnuo","room":"Salle 4 - TC","speakers":[{"id":"mbettucci2bd8cbab978842258c15d33baf46e0e5","name":"Martino BETTUCCI"}],"summary":"Le rôle du \"chef de projet\" est souvent oublié, voir mis à part dans les méthodes dites \"agiles\".\nOr, la vision de celui que je préfère appeler \"aide de projet\" est un atout majeur vis-à-vis des intérêts économiques et stratégiques d'un produit.\n\nJe vous propose que l'on reviennent ensemble sur un développement de produit plus à l'écoute des maîtres d'oeuvre dans ce monde si \"customer centric\".\n\nNous allons nous y essayer avec un simple jeu de rôle 🙂\n\nPUBLIC ATTENDU\nAtelier particulièrement conseillé à tous ceux qui ont un \"chef de projet\" que l'on comprends pas vraiment et à tous ceux qui n'ont pas eu un pour vous rappeler que ça s'est bien à quelque chose 👍\n\n#workshop","title":"L'agilité, rive droite (30 personnes max)","toTime":"2019-06-27 15:15","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:30","id":"cc-6eamtd9105042rkgrnr4cs4mij","room":"Salle 4 - TC","speakers":[{"id":"jleonardd44fbbdc8b8a4dc483493b3d11eaab77","name":"Julie LEONARD"}],"summary":"Le rôle du testeur n'étant pas bien décrit dans les Framework Agile, il est bien souvent oublié dans les équipes.\nJe vous propose de partager mes bonnes pratiques / retours d'expérience sur le rôle de testeur dans un projet Agile. La session débutera par un quizz (les participants auront besoin d’un smartphone avec accès internet).","title":"Le testeur dans un projet Agile","toTime":"2019-06-27 16:20","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:55","id":"cc-2mo2eajjpha15lb0vtls1kaf6v","room":"Salle 6 - TC","speakers":[{"id":"elegeay676858c2890e4b41abc9f243293ecdce","name":"Erwann LEGEAY"},{"id":"folivro837e605a43a34fc6957ec4d135fc151e","name":"Florent OLIVRO"},{"id":"fetourneaue697574c6dfb453eba508ad91b1f920c","name":"Florian ETOURNEAU"}],"summary":"Plongez au coeur d'une jeune entreprise libérée !\nAprès un peu plus de deux ans d'existence, voici comment s'est construit notre chemin de « libération ».\nRetour de cette expérience enrichissante, partage d'une vision : la co-construction, la co-organisation, fonctionnement, outillage, réussites et limites.\n\n#rex","title":"Retour d'expérience d'une entreprise libérée - MaxDS","toTime":"2019-06-27 10:45","type":"REX"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 11:10","id":"cc-4p71qscajfaomhoqh59gth7jbp","room":"Salle 6 - TC","speakers":[{"id":"mchainotbataille2f6ffed0fa664a8f8082aa671ccd7d3c","name":"Manuella CHAINOT-BATAILLE"}],"summary":"Au cours de cet atelier je vous propose d’expérimenter un éventail d’outils qui favorisent implication, compréhension, mémorisation, attention et gratitude dans les classes. En accord avec les valeurs du manifeste agile, ces outils sont inspirés de la psychologie positive, des pédagogies actives et de la pleine conscience.\n\nIls sont adaptables de la maternelle à l’enseignement supérieur… et même ailleurs.\n\n#workshop","title":"Pédagogie Agile : Et si l'implication, l'attention, la mémorisation et la gratitude se cultivaient ? (30 personnes max)","toTime":"2019-06-27 12:00","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 14:25","id":"cc-6s8c2csg98g3heeqm0t41m3fhl","room":"Salle 6 - TC","speakers":[{"id":"cvinerierd3645a8d0c954718849d6681f80bb039","name":"Carole  VINERIER"}],"summary":"Retour d’expérience sur les étapes clés qui m’ont permis d’avancer sur mon chemin pour petit à petit changer de job et me réaliser pleinement : prises de conscience, travail sur soi, pas en avant, en arrière, puis le grand saut !","title":"Petit pas deviendra grand.. ou pas ?","toTime":"2019-06-27 15:15","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:30","id":"cc-4ndrvpoj4t28tdj1aco13msmg0","room":"Salle 6 - TC","speakers":[{"id":"cswierkowski5ee7ffc5a3c44f0997baa9baef577093","name":"Céline SWIERKOWSKI"},{"id":"eelie77b62b9b577b49ecae3f3b000ef60350","name":"Eudes ELIE"}],"summary":"Dans ce monde complexe, nous nous efforçons tous de trouver des solutions efficientes à chaque problématique rencontrée (pro ou perso). Les plus convaincus des agilistes vous diront qu’on s’adapte sans cesse.\nEquipés de méthodes, postures, livres, outils, jeux sérieux, retours d’expérience, etc... nous tâchons d’être le plus pertinent possible.\nSauf que des fois... et bien on est en panne sèche...\nSans trop en dire, l’objectif visé par cet atelier est d’envisager une stratégie paradoxale pour parvenir à changer de point de vue et générer de nouvelles solutions.\nFacile à comprendre, mais sans doute plus difficile à maîtriser…(les connaisseurs apprécieront ^_^)\nOuverture d’esprit et imagination appréciée :)\n\n#workshop","title":"Les paradoxes de l'Art de la Guerre (30 personnes max)","toTime":"2019-06-27 16:20","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:55","id":"cc-6om66jg29j8ss715vo3hkdme3r","room":"Salle 7 - TC","speakers":[{"id":"tlegaca66eb97464304be0b7e3cd2aaab28640","name":"Thomas LE GAC"}],"summary":"Dans le cadre Scrum, plusieurs cérémonies animent et rythment le quotidien d’une équipe agile (Daily meeting, Sprint planning meeting, Démonstration,…). La rétrospective est celle qui a lieu à la fin d'une itération (sprint) et s'inscrit dans la logique d'introspection et d'amélioration continue prônée par les méthodes Agiles. C'est en effet lors de cette réunion que l'équipe tente de prendre du recul sur elle-même  et essaye d'améliorer les process projet et son organisation afin d'être plus efficace dans son quotidien. Elle est perçue différemment suivant que l’on se trouve du côté des participants (membres de l’équipe) ou que l’on se trouve au contraire dans le rôle d’animateur (Scrum Master, coach agile).\nCette présentation va donc tenter de vous donner les clés afin de réussir des rétrospectives efficaces et vivantes au travers de retours d’expériences, en espérant apporter de la plus-value à vos rétrospectives et donc à vos projets !","title":"La rétrospective Agile  ","toTime":"2019-06-27 10:45","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 11:10","id":"cc-3f0ddvs160cfsh0t151f68j2bo","room":"Salle 7 - TC","speakers":[{"id":"faimettidd26ee4193594ab896e4287e4aef8edc","name":"Fabrice AIMETTI"}],"summary":" Présentation du contenu de la session :\n\nCet atelier permettra de présenter le Clean Language, une technique de questionnement \"Clean\" qui a pour fonction d'aider la personne à découvrir et modifier par elle-même les métaphores et les représentations personnelles de son modèle du monde. Cette technique peut se révéler très utile pour les \"Agile\" Masters, Coachs Agiles, ... qui accompagnent les différents rôles d'une équipe, ou même l'équipe dans sa globalité, ... notamment pour débloquer certaines situations.\n\n#workshop","title":"Introduction au Clean Language (30 personnes max)","toTime":"2019-06-27 12:00","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 14:25","id":"cc-7svnpo2r9hpe9k1dfubhug84cm","room":"Salle 7 - TC","speakers":[{"id":"ycamus927a3bad58914347ac8afb556db3253c","name":"Yannis CAMUS"}],"summary":"L'agilité apporte énormément en terme d'organisations du travail dans les organisations qui la pratique mais qu'en est il des relations hiérarchiques, du management et de la gouvernance ? Le modèle de gouvernance sociocratique propose de différencier les prises de décisions stratégiques (prises par les personnes concernées suivant un protocole précis appelé \"décision par consentement\") et les prises de décisions opérationnelles (prises par les responsables). Yannis CAMUS proposera une conférence pour présenter la richesse de ce nouveau paradigme que de plus en plus d'organisations adoptent avant de nous faire expérimenter l'outil phare de la sociocratie : la décision par consentement.","title":"La sociocratie au service de l'agilité","toTime":"2019-06-27 15:15","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:30","id":"cc-2vt8qchq5pu0b594m8hnu7s80c","room":"Salle 7 - TC","speakers":[{"id":"aquachb11096111f5a4f83b2c9406ea8d43b2a","name":"Alexandre QUACH"}],"summary":"Innover ne signifie pas toujours créer depuis la page blanche\nComment faire lorsqu’on part d’un produit existant ?\nComment faire lorsqu’on veut utiliser nos forces déjà existantes pour les appliquer à un nouveau contexte ?\nDans cet atelier-jeu, venez découvrir une méthode pour innover autrement\nObjectifs pédagogiques\nDécouvrir une nouvelle forme d’innovation (variation d’un produit ou d’un service existant)\nS’entraîner à la créativité structurée\nDécouvrir des bases de raisonnement de design\n\nTous les détails https://openseriousgames.org/index.php/reverse-design/\n\n#workshop","title":"Reverse Design, Innover pour un nouveau contexte (30 personnes max)","toTime":"2019-06-27 16:20","type":"Workshop"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 09:55","id":"cc-596gk76l0ig85b39aj263qnikc","room":"Salle 8 - TC","speakers":[{"id":"dlaizec3a9c2d31a7d4b2fba45e7e3aa0bac78","name":"David LAIZE"}],"summary":"Un des 12 principes de l'agilité : Réalisez les projets avec des personnes motivées. Comme la phrase s'arrête là et n'explique pas comment faire ça, c'est un sujet que j'ai voulu creuser car c'est clairement un facteur de succès. Ce qui est moins évident ce sont les mécanismes de la motivation ? Pourquoi ce qui marche pour moi est inefficace pour d'autres ? Depuis quand la promesse d'une belle augmentation n'est plus l'arme ultime pour motiver les gens ? Vu que j'ai annulé le devis du baby-foot, sur quoi j'investis pour motiver mon équipe ?","title":"Si le baby-foot ça ne marche pas, comment je motive mon équipe ?","toTime":"2019-06-27 10:45","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 11:10","id":"cc-23fcfhe9fjdo9ooab6ab1igauq","room":"Salle 8 - TC","speakers":[{"id":"jlambert4dadf36fd1574416941293115bfc77ac","name":"Jean-Pierre LAMBERT"}],"summary":"Comment reconnaître une équipe vraiment agile ? À son niveau de collaboration : une équipe est vraiment agile dès lors qu’elle est en collaboration forte et permanente.\n\nMais qu'est-ce que cela veut dire en pratique ?\n\nQu'il s'agisse de ce niveau grisant de collaboration ou bien de sa complète et navrante absence, je vous propose de rejouer diverses scènes pour les illustrer.\nNous détaillerons également les pratiques qui découlent d'un tel niveau de collaboration, ou qui permettent de les pousser à l'extrême.","title":"La collaboration, signe d'une véritable agilité","toTime":"2019-06-27 12:00","type":"talk"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 14:25","id":"cc-06cp37j2f5q7naj6vribh0ni8f","room":"Salle 8 - TC","speakers":[{"id":"mruaud81de96a12f24fd294377adf8a6133de","name":"Mickaël RUAU"}],"summary":"\nL'éditeur IgniMotion m'a contacté pour l'aider dans sa transformation agile. Startup de 25 employés, en hyper-croissance, elle cherche à structurer son développement et exprime le besoin de réussir la version 2 du logiciel qu'elle édite. L'accompagnement a duré quatre semaines (mars-avril 2019). La méthode employée s'est basée sur Scrum Shock Therapy de Jeff Sutherland. Une fois les Product Owners désignés, les équipes Scrum ont été formées par Self Selection, et ont choisi leur Scrum Masters. Les personnes ont été formées à leur rôle Scrum, à l'Evidence Based Management puis Nexus (pour la gestion de plusieurs équipes Scrum). Cette séance est de type \"l'aventure dont vous êtes le héros\". A partir de l'exposé de la situation initiale et des principaux défis rencontrés au cours de cet accompagnement, les participants sont invités à réfléchir ensemble aux alternatives possibles. Le premier récit s'appuie sur le cas réel. Le scénario dérivé sera l'occasion d'explorer de façon imaginaire les impacts qu'auraient pu générer d'autres choix.\n\n#rex","title":"Transformation Agile avec Scrum Shock Therapy et Nexus","toTime":"2019-06-27 15:15","type":"REX"},{"conferenceId":"cc-20190627","fromTime":"2019-06-27 15:30","id":"cc-03itsu7jt26qbsnpo2fb2vif7b","room":"Salle 8 - TC","speakers":[{"id":"eviota19f8d27e2154c45b341d0a9e55a8eb4","name":"Estelle VIOT"},{"id":"fberthelot2a3aad7a2bb94005a69b498924835209","name":"Fany BERTHELOT"}],"summary":"Vous savez écrire ainsi que dessiner un triangle, un rond et un rectangle ? Alors venez expérimenter, à travers des ateliers ludiques, comment utiliser les bases de la facilitation graphique au quotidien !\nAu programme : présentation des éléments de base, bibliothèque visuelle, jeux...\n\nParce qu' \"Un bon croquis vaut mieux qu'un long discours\" !\n\n#workshop","title":"Exprimer ses idées autrement, en utilisant les bases de la facilitation graphique (30 personnes max)","toTime":"2019-06-27 16:20","type":"Workshop"}]