[{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:35","id":"cc-22vm88kgu0qda626dio44qfccg","room":"Arial, 6e PSE  ","speakers":[{"id":"esiha@xebia.fr","name":"esiha"}],"summary":"**Pitch**\n\nCréneau de travail sur le retour des Xebia Essentials :\n* On définit les cibles visées\n* On se réparti les tâches\n* On commence à tabasser !\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nAucun","title":"Hands On - Retour Xebia Essentials","toTime":"2020-03-02 19:30","type":"handson"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 11:05","id":"cc-40i3rq6cjdj5arekq5p9a7r183","room":"Auditorium","speakers":[{"id":"jmartinezlago@xebia.fr","name":"jmartinezlago"}],"summary":"**PITCH**\n\nSi vous voulez mémoriser par coeur: des définitions pour obtenir une certification, des patrons de conceptions de programmation, les differentes options de commandes git, docker, kubectl..., une langue étrangère... bref, tout ce que vous voulez.\n\nDans ce talk je vous présente une appli qui vous permet de retenir toutes ces information pour toujours, avec une méthode de mémorisation prouvée scientifiquement et optimisée pour passer le moins de temps possible à étudier. \n\n**Niveau** \ndébutant\n\n**Pré-requis**\nOuvert à toutes et à tous, techs ou pas. ","title":"Demo - Comment tout mémoriser, sans (presque) jamais oublier","toTime":"2020-03-02 12:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 14:35","id":"cc-6fgh4ug4j8n96816bgcbn275cr","room":"Auditorium","speakers":[{"id":"meckert@xebia.fr","name":"meckert"},{"id":"asgirault@xebia.fr","name":"asgirault"}],"summary":"**Pitch**\n\nNos expériences professionnelles, vécues dans des environnements complexes, provoquent souvent du stress. Mais qu’est-ce que le stress ? Quelles sont nos stratégies d’adaptation face à une situation stressante - autrement appelé le coping? Quels sont les types de stresseurs internes ou externes, autrement dit les causes qui génèrent le stress ? Qu’il s’agisse de la personnalité, du caractère motivationnel de la tâche ou encore du stresseur de rôle, nous tenterons de cerner les contours du stress, pour aborder également ses effets, ses variables (intensité, durée, absorption), évoquer la zone d’impact comme zone d’action possible et le syndrome général d’adaptation. Nous évoquerons aussi les principes d’engagement, d’addiction et de compulsion au travail pour évoquer le sujet difficile du burn-out et être plus à même de le détecter. Un petit exercice simple de coaching professionnel sera présenté, ainsi qu’un take away des idées clefs.\nPar delà cette présentation théorique d’une heure par Anne-Sophie, Morgane interviendra durant la seconde partie de la présentation pour un retour d’expérience sur l’usage de plusieurs outils concrets et faciles à activer dans le quotidien professionnel ou personnel.\n\n**Niveau**\n débutant\n\n**Pré-requis**\nPas de tabous et être prêt à pratiquer :) \n\n** Présentation en deux heures 1ere heure Anso / 2eme heure Morgane**\n- Slot d'une heure de Anso READY - Support de présentation chargé.\n- Slot à suivre de Morgane READY","title":"SOFT SKILLS TRACK - La Gestion du Stress","toTime":"2020-03-02 16:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 16:35","id":"cc-0l2gj6qp0p4p12a0an9otapbd2","room":"Auditorium","speakers":[{"id":"omarquet@xebia.fr","name":"Olivier Marquet"}],"summary":"Vous êtes vous déjà retrouvé en pleine discussion avec un profil de personne particulier où vous vous demandiez « mais c quoi son profil MTBI? » ou « tiens je me demande dans quelle phase process comm il/elle est ? » et ça sans jamais que cotre cerveau ait le temps de cogiter un résultat ?\n\nLe DISC est un modèle identifiant les styles de comportement et permettant de s’adapter a son interlocuteur pour une meilleure communication.\n\nBien que plutôt simple contrairement à d’autres modèles, il est surtout utilisable en temps réel. \n\nDans ce slot nous verrons ce qu’est le disc et comment l’utiliser mais aussi nous découvrirons votre profil et comment le détecter chez les autres.","title":"Formal : Les styles de comportements","toTime":"2020-03-02 17:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 12:05","id":"cc-2qjmh1nbu947gq41u5q3lodivh","room":"Auditorium","speakers":[{"id":"pauline.girardey@publicissapient.com","name":"pauline.girardey"},{"id":"asgirault@xebia.fr","name":"asgirault"}],"summary":"Pauline Girardey est UX Researcher &amp; Experience Strategist &amp; Senior Manager chez Publicis. \nAnne-Sophie Girault le Mault est coach agile et coach professionnelle chez PSE.\nQuand Anne-Sophie a croisé Pauline en mission aux Galeries Lafayette, sa première réaction a été de se demander ce que pouvait bien faire une ethnologue dans ce contexte et chez PS.\nEt puis l'étude Royal Canin se présente quelques mois plus tard. Pauline contacte Anne-Sophie pour venir la rencontrer chez elle.\nDe là...Un tout petit REX par Anne-Sophie, suivi d'une présentation par Pauline de son métier et d'un échange pour envisager de futures collaborations.\n\nWe are One ? Alors venez nombreux à cette présentation en duo PS / PSE.\n\nMon support de présentation pour les 10 premières minutes : https://docs.google.com/presentation/d/1vf3Ue0wH5iNu5lkuOTxJqTtX438KFl4N62Revsm3PGM/edit?usp=sharing","title":"Formal - La coach et l'ethnologue - UX Researcher & Experience Strategist...WTF ? Eloge de la rencontre.","toTime":"2020-03-02 13:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 10:05","id":"cc-3noorps9ds88ivn0606ltcfbi9","room":"Auditorium","speakers":[{"id":"aaguilar@xebia.fr","name":"aaguilar"}],"summary":"Le jeu « The Roadmap Game » est une adaptation du jeu « The big payoff » créé par Alexandre Boutin et Erwin van der Koogh lors de la conférence Agile Games de Boston en 2011.\n\nLe Roadmap Game est un jeu dont l'objectif est de faire comprendre la comment définir la stratégie de release en mode Agile.\n\nMise en contexte :\n Le PDG (le facilitateur) demande à son CODIR de décider de la stratégie de l'entreprise sur les mois à venir. Le PDG a identifié un certain nombre de besoins dont la rentabilité estimée semble bonne et il souhaite organiser les développements de ces besoins de manière à optimiser le résultat de l'entreprise.\n Vous êtes les membres de ce CODIR (les joueurs) et votre PDG attend de vous des merveilles sur le plan financier sur l’année à venir, saurez-vous relever ce challenge et assurer une rentabilité de l'entreprise supérieure à 1 Million d'Euros ?\n\n**Niveau**\n\nDébutant\n\n**Pré-requis**\n\nAucun\n\n**Contraintes**\n\nUne salle avec des tables pour faire des équipes de 4.","title":" Atelier - Roadmap Game","toTime":"2020-03-02 11:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:35","id":"cc-7pjfolv4jali1asrctu2gqpjfd","room":"Auditorium","speakers":[],"title":"Fondation Agile","toTime":"2020-03-02 18:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 09:00","id":"cc-02t2j53keqfrdngck07rk3jgdj","kind":"keynote","room":"Auditorium","speakers":[],"title":"Petit Déjeuner","toTime":"2020-03-02 09:30","type":"lunch"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 09:30","id":"cc-6gu0gc6tokgtc1ep46g15e7j5k","kind":"keynote","room":"Auditorium","speakers":[{"id":"emoysan@xebia.fr","name":"emoysan"},{"id":"tcavin@xebia.fr","name":"Thibaud Cavin"}],"title":"Plénière Direction","toTime":"2020-03-02 10:00","type":"keynote"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 13:05","id":"cc-2hdp1l6qe12q5mvt08okb53rac","kind":"keynote","room":"Auditorium","speakers":[],"summary":"Menu :\n* 1 hot dog par personne OU 2 (bagel / sandwich) pour les personnes qui ne souhaitent pas de viande\n* 1 salade par personne\n* 1 paquet de chips\n* 1 dessert au choix par personne\n\nPortrait photo 12h45 - 14h15:\n* 4ème étage niveau accueil client\n* Tenue neutre\n* Éviter les gilets Xebia\n\n\n","title":"Déjeuner + portrait photo","toTime":"2020-03-02 14:00","type":"lunch"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 14:00","id":"cc-4guvjfb1l7f7ih6gb76h8rqvto","kind":"keynote","room":"Auditorium","speakers":[],"title":"Newcomers","toTime":"2020-03-02 14:25","type":"keynote"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 14:25","id":"cc-2veg3hdnhbh6102gdug7025qlv","kind":"keynote","room":"Auditorium","speakers":[],"title":"Plénière - Annonce pour la Xebicon","toTime":"2020-03-02 14:30","type":"keynote"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 10:05","id":"cc-74d18sdh34dh41inf2t5l4hoql","room":"Avenir Black","speakers":[{"id":"rdelaplace@xebia.fr","name":"rdelaplace"}],"summary":"**Pitch**\n\nLe Natural Language Processing est un domaine vaste avec autant de possibilités d'analyse, de génération, d'identification qu'il y a de difficultés pour mettre en place ces recherches.\n \nDans cette session, je vais vous présenter trois algos basiques en NLP et des cas de figures concrets dans lesquels ils ont été utiles.\n\n**Niveau**\n\ndébutant\n \n**Pré-requis**\n\nÊtre curieux.\nConnaitre au moins une langue et savoir écrire dans celle-ci.\n\nAimer les chats.","title":"Formal - Introduction au NLP 2, des algos en NLP ?","toTime":"2020-03-02 11:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 16:35","id":"cc-4a98i8g2rrj70qt29d854gkvrj","room":"Avenir Black","speakers":[{"id":"jjouanne@xebia.fr","name":"jjouanne"},{"id":"fdesrousseaux@xebia.fr","name":"Florian Desrousseaux"},{"id":"jpinsolle@xebia.fr","name":"jpinsolle"}],"summary":"**Pitch**\n\nNous vous présenterons les dernières statistiques du blog et après nous vous laisserons la parole.\n\nLe but est de nous dire ce que vous aimez et n'aimez pas sur le blog.\n\nL'organisation des catégories, la page d'accueil, les news, les tags... je suis persuadé que vous avez un avis.\n\nAlors venez donner votre avis et influencer le futur du blog !\n\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nAucun","title":"Bloggons peu, bloggons bien","toTime":"2020-03-02 17:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 12:05","id":"cc-4q7dm0gsm59tt0369bn5jlum4j","room":"Avenir Black","speakers":[{"id":"fcussac@xebia.fr","name":"fcussac"}],"summary":"**Pitch**\n\nTu n'as jamais fait de cloud mais tu aimerais bien t'y mettre ?\nTu es perdu.e une fois arrivé.e sur la console de ton provider car elle est dégueue et qu'il y a beaucoup trop de services ?\nTu n'oses pas tester le moindre service car tu as peur de faire une connerie et  de dépenser 3000€ en 1 journée ?\n\nCe slot est fait pour toi ! Dans ce slot tu découvriras tout ce qui m'a permis de me sentir à l'aise sur le cloud et d'aujourd'hui être assez autonome pour m'auto-former.\n\nNous nous concentrerons autour des services aws EC2, IAM et VPC.\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\ntélé / vidéoprojecteur","title":"REX / Demo - Tout ce que j'ai besoin de savoir pour me lancer dans le cloud","toTime":"2020-03-02 13:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:35","id":"cc-1ascan8oass8r7jke7lj1m2i1m","room":"Avenir Black","speakers":[{"id":"tsimonnet@xebia.fr","name":"tsimonnet"}],"title":"Fondation Front","toTime":"2020-03-02 18:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 11:05","id":"cc-11l2ic314vq22objdusp38leqs","room":"Avenir Black","speakers":[{"id":"ldivad@xebia.fr","name":"ldivad"}],"summary":"Ce talk donne une vue d'ensemble des éléments à tester dans vos applications Kafka Streams. Il inclue des extraits de code / astuces qui vous aideront à initier les tests. Il présentera un pipeline d’intégration continue et un exemple de déploiement sur Confluent Cloud. Vous n’aurez plus d’excuses pour ne pas tester vos applications Kafka Streams.\n\nA partir d’un toy use case, nous construirons une application complète! Nous inclurons un proposition pour la couverture, l’automatisation des tests unitaires comme intégration et le déploiement. Tout cela pour vous montrer que cette librairie de traitement de données en temps réel n’échappe pas aux standards de qualité. Streaming Apps Done Right!\n\n*Level*: \nAdvanced\n\n*Prérequis*:\nNone ","title":"Formal - Test your Kafka Streams application","toTime":"2020-03-02 12:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 14:35","id":"cc-0pcq9e4icvettvht6v7qvcb9qf","room":"Avenir Black","speakers":[{"id":"ponneby@xebia.fr","name":"Peter Önneby"},{"id":"achaabani@xebia.fr","name":"achaabani"}],"summary":"**Pitch**\nCeci est un atelier pour les profils non tech.\nVenez faire un kata de refactoring sans coder !\n\nObjectifs:\n- Comment ça se passe ?\n- Pourquoi faire du refactoring ?\n- Par où commencer ?\n- Quelles sont les bonnes pratiques ?\n\n**Niveau**\nTous les niveaux\n\n**Pré-requis**\nUn ordinateur avec une connexion internet pour chaque groupe de 3/4 personnes","title":"Hands-On - Refactoring Zero : Un Kata 0% code","toTime":"2020-03-02 16:30","type":"handson"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 10:05","id":"cc-0eu1ns7ao5lkbkeofvsdtabifg","room":"Avenir Light + Book","speakers":[{"id":"bbousquet@xebia.fr","name":"bbousquet"},{"id":"galbini@xebia.fr","name":"galbini"}],"summary":"**Pitch**\n\nKubernetes s’est imposé comme une plateforme de déploiement d’applications. Outre ses nombreux avantages (flexibilité technologique avec l'utilisation des containers, scalabilité horizontale et extensibilité grâce aux CRDs), Kubernetes reste toutefois relativement complexe à mettre en œuvre notamment pour les équipes de développement. Knative propose, d’une part, d’offrir une expérience de déploiement simplifiée et, d’autre part, la mise en place aisée d’une architecture event driven serverless. Mais ce n’est pas tout. Grâce à son intégration native à Kubernetes et profitant des offres managées des cloud providers, Knative permet de réellement envisager la mise en œuvre d’infrastructures multi-cloud tout en gardant une cohérence de développement et de déploiement. L’objet de cette présentation est de vous montrer comment mettre en œuvre une telle architecture et d’en faire une démonstration.\n \n\n**Niveau**\n\nIntermédiaire\n \n\n**Pré-requis**\n\nConnaissances générales Kubernetes","title":"Formal - [CONF2020] Déployer une architecture event driven multi-cloud avec Knative","toTime":"2020-03-02 11:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 12:05","id":"cc-2lhdot0kcnc52j96lboebtb225","room":"Avenir Light + Book","speakers":[{"id":"gyam@xebia.fr","name":"gyam"}],"summary":"**Pitch**\n \nComment un modèle en trois dimensions est-il transformé par un processeur graphique en une image ? Pour y répondre, je développerai en live des programmes simples que l'on appelle des shaders, qui nous permettront d'ajouter une texture et des \"ombres\" détaillées à ce modèle 3D.\n\nPas besoin de connaître la 3D pour ce slot. Je vulgariserai un maximum.\n\nJe vous présenterai ce qu'est un shader et je vous montrerai qu'un simple triangle en 3D est beaucoup plus que ce qu'il n'en a l'air. Progressivement, je démontrerai différentes phases du pipeline de rendu par un live coding dont les résultats seront très visuels.\n\nPour les connaisseurs : j'utiliserai Unity SDK, donc le langage Cg/HLSL. Cependant, les concepts abordés sont plus intéressants que le langage lui-même. Je m'attarderai particulièrement sur Vertex shader, la phase Rasterizer, et le Fragment/Pixel shader. Le Standard Surface Shader ne sera pas utilisé : On reprogrammera la lumière de zéro en un rien de temps.\n\n### Plan\n- Placer et projeter les objets sur la caméra : Vertex shader / Modèle 3D et changements de repère\n- Permettre le traitement des pixels : La phase de rasterisation\n- Colorier les pixels avec une texture : Fragment shader / L'interpolation UV\n- Nuancer par la lumière : Les normales / Ambient &amp; Diffuse\n- Donner l'illusion de surfaces lisses : L'interpolation des normales\n- Sculpter la surface sans ajouter de polygones : La tangente et la binormale\n\n### Extras\n\n- Du plastique au cartoon : Le cel shading\n- Se prendre les reflets dans les yeux : Specular\n- Après la phase Q&amp;A : Démo de mes shaders à moi\n \n**Niveau**\n \ndébutant\n \n**Pré-requis**\n \naucune connaissance de la 3D ni du langage ni de shaders ni de mathématiques n'est nécessaire\n\n\n \n**contraintes**\n\nIl faut que j'utilise une souris, par conséquent il me faut une table plate, pas un pupitre.","title":"LiveCoding - Les Shaders 3D, Découverte","toTime":"2020-03-02 13:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 16:35","id":"cc-3u615hr2dfovdqj8cs7141pgp8","room":"Avenir Light + Book","speakers":[{"id":"dchesters@xebia.fr","name":"dchesters"},{"id":"esiha@xebia.fr","name":"esiha"}],"summary":"**Pitch**\nJava 14 va apporter la possibilité de créer des Records. Un petit tour d'horizon de ce que c'est et ce qu'on peut faire avec s'impose.\n\n**Niveau**\nIntermédiaire (Avoir déjà écrit quelques Java Beans, avoir une idée de ce qu'est l'immutabilité)\n\n**Pré-requis**\nAucun","title":"Live Coding - Java Records","toTime":"2020-03-02 17:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:05","id":"cc-61uvfj6b02l3rnasjadkgdsd5f","room":"Avenir Light + Book","speakers":[{"id":"cdreyfus@xebia.fr","name":"cdreyfus"}],"summary":"**Pitch**\n \n```Code &gt; Convert Java File to Kotlin File``` : “It’s a trap!” – Admiral Ackbar\n\nL'historique Java est le legacy le plus courant à gérer sur une application Android mais il est généralement compliqué de mener à bien une migration vers Kotlin de manière efficace et sans risques de régression. Si vous pensiez que la conversion automatique ferait tout pour vous, venez découvrir les combats que vous aurez à mener pour passer du bon côté de la force et les éléments clés à ne pas négliger.\n \n**Niveau**\n \nDébutant\n \n**Pré-requis**\n\nAvoir les bases Java/Kotlin","title":"REX - Java is dead, long live Kotlin: comment quitter le côté obscur sur une application Android (répétition Talking.kt)","toTime":"2020-03-02 17:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 14:35","id":"cc-4p046m4lkukp1nec5pllsvgug2","room":"Avenir Light + Book","speakers":[{"id":"pgdejardin@xebia.fr","name":"pgdejardin"},{"id":"sdecout@xebia.fr","name":"sdecout"}],"summary":"Rejeu d'un hands-on déjà présenté en Janvier. Répétition pour BreizhCamp.\n\n**Pitch**\n\nEn bon crafts(wo)men, les tests unitaires, ça va, on commence à connaître. Tester le comportement de mon code en trouvant des exemples bien représentatifs, c'est devenu quasiment automatique… Mais est-ce que cette approche est vraiment si naturelle que ça ? Est-ce que réduire ma compréhension de règles logiques en exemples, ce n'est pas introduire un biais qui va priver nos tests d'une partie de ma compréhension du problème ?\n\nC'est l'idée sur laquelle se construit le Property-Based Testing : à l'inverse d'un \"Example-Based Testing\", vous décrivez les \"propriétés\" de votre code, et c'est le moteur qui s'occupe de choisir des exemples pour essayer de trouver vos erreurs !\n\nCet atelier a pour objectif de vous présenter le Property-Based Testing par la pratique, avec le framework Jqwik (Java / JUnit 5). Vous repartirez avec une bonne vision des raisons pour lesquelles l’utiliser, de quand l’utiliser ou non, et surtout tous les outils pour le mettre en place sur vos projets de la vraie vie !\n\n**Niveau**\n\nMoyen\n\n**Pré-requis**\n\nUne machine avec Java 8\nRepo Git à cloner : https://github.com/sylvaindecout/jqwik-handson","title":"Hands-on - Le Property-Based Testing en Java par la pratique","toTime":"2020-03-02 16:30","type":"handson"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 11:05","id":"cc-3nlc0egvr7970dbcasgai9rjha","room":"Avenir Light + Book","speakers":[{"id":"jcalderan@xebia.fr","name":"jcalderan"}],"summary":"**Pitch**\n\nVous vous demandez pourquoi tout les Ops que vous croisez couinent \"Kubernetes\" en sautillant sur place ?\nVoici une initiation rapide à Kubernetes:\n- c'est quoi un conteneur ?\n- c'est quoi un orchestrateur ?\n- c'est quoi un Pod \n- comment executer un Pod ? (Job / ReplicaSet / Deployment)\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nVidéo projecteur ou Télé.","title":"Formal - Initiation à Kubernetes: Pods, Job, RepicalSet et Deployement","toTime":"2020-03-02 12:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:35","id":"cc-6mckt152l0ccj4805k3pcnv72d","room":"Avenir Light + Book","speakers":[{"id":"jjublanc@xebia.fr","name":"jjublanc"}],"title":"Fondation Data","toTime":"2020-03-02 18:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 16:35","id":"cc-5o46u4hnp3hejmsdcpt4bs4jlu","room":"Avenir Roman + Medium","speakers":[{"id":"achotard@xebia.fr","name":"achotard"}],"summary":"**Pitch**\n \nOK, Kotlin c'est cool. vous ne seriez pas là sans en être déjà convaincu. Mais qu'est-ce que ça apporte concrètement ? Évitons la classique et banale comparaison à Java... et parlons des avantages de Kotlin dans un contexte d'outillage à la limite du scripting, en venant de Python. Ce talk est un réel retour d'expérience d'un recodage complet d'un outil en Python vers du Kotlin. De l'outillage autour de la gestion de talks d'une conférence, justement !\n\nCe talk est une répétition pour TalkingKt.\n \n**Niveau**\n \nDébutant\n \n**Pré-requis**\n \nAucun\n\n**Contraintes**\n\nUn pied de micro si possible ? Potentiel live-coding, je ne sais pas encore.","title":"From Python to Kotlin (répétition TalkingKt)","toTime":"2020-03-02 17:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 14:35","id":"cc-66kcnrcve7mv5cogli992a0pos","room":"Avenir Roman + Medium","speakers":[{"id":"plopez@xebia.fr","name":"Pablo Lopez"},{"id":"ocloirec@xebia.fr","name":"ocloirec"}],"summary":"Nous fournissons une application d'e-commerce, déployée dans des conteneurs, sur Kubernetes.\nCelle ci possède déjà toute l'instrumentation nécessaire à son observabilité.\nQui aura la vision la plus fine afin d'éviter les bugs (volontaires) et maximisera la disponibilité, les performances et donc les revenus de son site ?","title":"Hands On / Contest - Observabilité","toTime":"2020-03-02 16:30","type":"handson"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 12:05","id":"cc-59panvc58qafues8h0cmmt65dp","room":"Avenir Roman + Medium","speakers":[{"id":"tpesneau@xebia.fr","name":"tpesneau"}],"summary":"**Pitch**\nVous avez peut être déjà entendu parler de Bayes sans trop savoir ce que c'était. Je vous présente ici différentes approches des stats et les intérêts de l'approche Bayésienne. Au menu:\n- C'est quoi ?\n- Quels intérêts ?\n- Et en deep learning ?\n\n**Niveau**\nMoyen\n\n**Pré-requis**\nDes bases en statistiques et proba","title":" Formal - Bayes bayes fréquentistes, une autre approche du Machine Learning","toTime":"2020-03-02 13:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:35","id":"cc-6pf85hhmhuopcumfl4filgircv","room":"Avenir Roman + Medium","speakers":[{"id":"achotard@xebia.fr","name":"achotard"}],"summary":"**Pitch**\nUn certains nombre de Xebians ont décidé de se lancer dans les certifications Kubernetes (CKAD et/ou CKA). Ce slot est pour ces Xebians : nous y partagerons des objectifs communs, des tips &amp; tricks liés à la certification, et d'autres choses encore.\n\nCe slot est dissocié de la Kubernetes Winter School - les deux sont complémentaires, mais l'un n'est pas indispensable pour  l'autre !\n\n**Niveau**\nWanna-be certified (CKAD / CKA)\n \n**Pré-requis**\nAucun","title":"Certifications Kubernetes - Followup #2","toTime":"2020-03-02 18:05","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:05","id":"cc-3s23tn9amtu4uf9hcen41u1mjo","room":"Avenir Roman + Medium","speakers":[{"id":"mohayon@xebia.fr","name":"Michaël Ohayon"}],"summary":"**Pitch**\nJe vous propose de vous présenter le GSoC, le programme de financement de projets Open Source par Google.\n\nBlender, CNCF, Debian, FFMPEG, Git, Gnome, Jenkins, MariaDB, Mozilla, Ruby et bien d'autres font partie du GSoC.\n\nNous verrons comment celui-ci fonctionne, quelles sont les dates clés, les objectifs et autres rouages du programme.\n\nIl y a quelques années j'ai pu contribuer en tant qu'étudiant, depuis je mentore des étudiants pour continuer à faire vivre le projet éducatif Sugarizer.\n\nSi vous êtes fan de logiciel libre c'est un moyen de contribuer ou de découvrir comment de nombreux programmes sont financés et développés !\n\n**Niveau**\nTous\n\n**Pré-requis**\nAucun","title":"REX Google Summer of Code","toTime":"2020-03-02 17:30","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 18:05","id":"cc-6h09lccd4qfl9935a6e3h04jbl","room":"Avenir Roman + Medium","speakers":[{"id":"achotard@xebia.fr","name":"achotard"}],"summary":"**Pitch**\nCe slot est une session du \"mentoring\" sur Kubernetes : la **Kubernetes Winter School**.\n\nLes participants sont déjà connus et ce slot est la 5e occurrence d'une session hebdomadaire de formation Kubernetes interne. Si vous souhaitez venir, la porte sera ouverte, mais attendez vous à arriver en plein milieu d'une suite de sujets !\n\nCe slot est dissocié de celui dédié aux certifications.\n\n**Niveau**\nIntermédiaire\n\n**Pré-requis**\nÊtre OK avec les conteneurs et les notions de base de Kubernetes : pods, deployments, services, exposition d'applications, configuration de conteneurs/pods, fonctionnement de K8s, etc.","title":"Mentoring - Kubernetes Winter School #9","toTime":"2020-03-02 19:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 10:05","id":"cc-2r6gveuse8b2ipi06gn0aak6bo","room":"Avenir Roman + Medium","speakers":[{"id":"emoysan@xebia.fr","name":"emoysan"},{"id":"tcavin@xebia.fr","name":"Thibaud Cavin"}],"summary":"Pitch\nSuite à la plénière direction un créneau pour discuter ouvertement de la vision PS/PSE dans les mois et années à venir. Pas de tabou. \n\nNiveau\nDébutant\n\nPré-requis\nPréparez vos questions","title":"Debate - Q&A Vision PS/PSE - créneau 1","toTime":"2020-03-02 11:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 11:05","id":"cc-3iqa1k0ef4l5squ5472dgh0g57","room":"Avenir Roman + Medium","speakers":[{"id":"emoysan@xebia.fr","name":"emoysan"},{"id":"tcavin@xebia.fr","name":"Thibaud Cavin"}],"summary":"Pitch\nSuite à la plénière direction un créneau pour discuter ouvertement de la vision PS/PSE dans les mois et années à venir. Pas de tabou. \n\nNiveau\nDébutant\n\nPré-requis\nPréparez vos questions","title":"Debate - Q&A Vision PS/PSE - créneau 2","toTime":"2020-03-02 12:00","type":"talk"},{"conferenceId":"cc-20200302","fromTime":"2020-03-02 17:35","id":"cc-5ii1rvimfv63bii6kranmv1p4c","room":"PSE puis la Choppe Saint-Fargeau","speakers":[],"title":"After XKE et partage","toTime":"2020-03-02 20:00","type":"talk"}]