[{"conferenceId":"cc-20190909","fromTime":"2019-09-09 14:35","id":"cc-7koheo1b68s809hg15eo16fg3m","room":"Auditorium","speakers":[{"id":"lvol@xebia.fr","name":"Laurène Thénoz"},{"id":"ybenoit@xebia.fr","name":"Yoann Benoit"}],"summary":"**Pitch**\n\n- \"*Tu as de la chance toi tu vas au cinéma avec ta femme, nous on peut pas avec les enfants*\"\n- \"*Bah tu devrais prendre une Baby Sitter*\"\n- \"*Oui mais... une bonne baby sitter c'est dur à trouver du sais*\"\n- \"*Bah J'en connais une très bien si tu veux*\"\n- \"*Oui mais... c'est trop cher une baby sitter, c'est un peu serré en ce moment*\"\n- \"*Bah tu pourrais demander à tes beaux parents*\"\n- \"*Oui mais... je suis sûr que ça va les déranger*\"\n- \"*Bon bah écoute si tu veux pas aller au cinéma, c'est ta vie hein !*\"\n- \"*Mais pourquoi tu dis ça ? Pff laisse tomber tu peux pas comprendre*\"\n\nCette discussion est typique d'un échange entre une *victime* et un *sauveur*, qui basculent ensuite de rôles vers le *persécuteur*. \n\nNous jouons tous les jours à des jeux psychologiques, plus ou moins dangereux, consciemment ou non, qui visent à satisfaire nos besoins inexprimés ou à renforcer nos scénarios de vie.\n\nInspiré du livre *Des jeux et des hommes*, nous vous proposons de vous présenter quelques-uns des jeux psychologiques les plus courants afin de les identifier et comprendre pourquoi nous y jouons.\n\n \n**Niveau**\n \ndébutant \n\n**Pré-requis**\n \nUn esprit ouvert :)","title":"Formal - Les jeux psychologiques","toTime":"2019-09-09 15:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 10:05","id":"cc-3kro3q4nmfh4r0k3g6qihek40q","room":"Auditorium","speakers":[{"id":"galbini@xebia.fr","name":"galbini"}],"summary":"**Pitch**\n\nMesdames, Messieurs,\nLe propos de cette présentation est de montrer que les mécanismes qui sont à l’oeuvre dans la nature s’appliquent également à nos frameworks, librairies et outils que nous utilisons au quotidien. Nos frameworks naissent, grandissent, se reproduisent et meurent tout comme les animaux, les plantes ou même les bactéries habitant notre planète. Ces fidèles compagnons du développeur vivent au sein d’écosystèmes et sont soumis à la sélection darwinienne au même titre que n’importe quelle espèce sur Terre. Pour soutenir ma théorie je m’appuierai sur des exemples et utiliserai les données issues de Google Trends et de Stack Overflow Trends qui permettent de voir l’évolution de l’usage de nos frameworks favoris dans le temps. En analysant les courbes produites par ces merveilleux outils il sera peut être même possible de prédire l’avenir de nos compagnons ou tout du moins d’imaginer une version plausible de celui-ci parmi l’ensemble des possibilités. A la fin de mon exposé lorsque vous devrez choisir un framework, une librairie ou un outil vous ne le ferez probablement plus de la même manière.\n\n**Niveau**\n\nDebutant\n\n**Pré-requis**\n\nAucun","title":"Formal - Les frameworks sont-ils des êtres vivants ? [XebiCon]","toTime":"2019-09-09 11:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 12:35","id":"cc-3pc99s0f6pq36e852ab3q0m80m","room":"Auditorium","speakers":[{"id":"dchesters@xebia.fr","name":"dchesters"},{"id":"njozwiak@xebia.fr","name":"Nicolas Jozwiak"},{"id":"xdelecourt@xebia.fr","name":"xdelecourt"}],"title":"REX - Démarrage One Carrefour","toTime":"2019-09-09 13:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 11:05","id":"cc-0k5kmo1790jpdtblcqniaeukot","room":"Auditorium","speakers":[{"id":"achotard@xebia.fr","name":"achotard"}],"summary":"**Pitch**\n\nVous entendez peut-être (probablement ?) de plus en plus parler de Scaleway depuis environ un an. Que ce soit sur les news de l'écosystème FR ou si le Slack de Xebia, ils sont en effet de plus en plus présent, en particulier dans notre environnement immédiat.\n\nPourquoi parle-t-on autant de Scaleway ? Ce slot présentera un peu ce qu'ils font, pourquoi ils font du bruit, ainsi que les grandes lignes de la relation Xebia/Scaleway. Ce slot sera suivi par un REX de la mission de coaching dans un prochain XKE.\n\n**Niveau**\n\nDébutant\n \n\n**Pré-requis**\n\nNéant","title":"Scaleway, pourquoi en parle-t-on autant ?","toTime":"2019-09-09 12:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 12:05","id":"cc-3hb7d5u3bbgrcn2qtm8199pq96","room":"Auditorium","speakers":[{"id":"esiha@xebia.fr","name":"esiha"}],"summary":"**Pitch**\n Et si on prenait deux secondes pour se poser ?\n\nC'est quoi le temps ? Comment on le mesure ? GMT, UT1, UTC, secondes intercalaires... Est-ce vraiment utile de faire si compliqué ?\n\nEt dans mon code Java, au quotidien, je dois utiliser quels concepts pour pas être embêté plus tard ?\n\nAh et tant qu'on y est, j'ai des tests unitaires qui échouent quand on passe à l'heure d'hiver/d'été. Y'a un TODO dessus mais j'ai pas pris le temps de regarder...\n\nEt si on prenait deux secondes pour se poser ? Tenter de répondre à ces questions et mieux comprendre pourquoi gérer le temps c'est si compliqué ?\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nAucun","title":"Formal - [Xebicon] What the UTC?","toTime":"2019-09-09 12:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 17:35","id":"cc-0qg086iasbmjarv9ld39s90ssb","room":"Auditorium","speakers":[],"title":"Fondation Agile","toTime":"2019-09-09 18:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 09:00","id":"cc-394d60pdc56j2rhnb20rvhronf","kind":"keynote","room":"Auditorium","speakers":[],"title":"Petit déjeuner","toTime":"2019-09-09 09:30","type":"lunch"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 09:35","id":"cc-1uu2qsbuvidiqo83il82npdgu2","kind":"keynote","room":"Auditorium","speakers":[],"title":"Plénière Management Academy","toTime":"2019-09-09 10:00","type":"keynote"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 14:05","id":"cc-3iq1c2cg98clusvu5q0fviqc5f","kind":"keynote","room":"Auditorium","speakers":[],"title":"Newcomers","toTime":"2019-09-09 14:30","type":"keynote"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 15:35","id":"cc-7d4h14fl6j35ai7nd1rqvdmp6k","room":"Auditorium","speakers":[{"id":"akinsella@xebia.fr","name":"Alexis Kinsella"},{"id":"ybenoit@xebia.fr","name":"Yoann Benoit"}],"summary":"Pitch\nDurant cette session, nous vous proposerons de vous joindre à Marc Cabossel, de l'équipe des Solutions Architects AWS, pour un Deep Dive en mode \"avancé\" dans le monde d’Amazon SageMaker.\n\nSageMaker est le service d'AWS qui permet aux Machine Learning Engineers et Data Engineers de construire, entraîner et déployer des modèles Machine Learning.\n\nCette session résolument technique, vous permettra de découvrir comment faciliter la mise au point de vos projets AI/ML avec les nouveautés 2019 du service et vous serez challengés par des exercices de mise en pratique avancée sur le service via l'utilisation de Notebooks Jupyter.\n\nVous aurez à disposition des accès à des comptes pré-configurés pour faciliter le déroulement de la session.\n\nNiveau\nAvancé d'un point de vue IA. Débutant côté Cloud.\n\nPré-requis\nLes comptes pour se connecter seront fournis.\n\nInfos\nSpeaker Booké et confirmé chez AWS.\n\nPartie 1: Détail des offres AI/ML (Plat de lasagne des services)\nPartie 2: \nDeep Dive (Complexité technique niveau 300/400 =&gt; Niveau le plus avancé)\nCasse tête avec algo à mettre en place. (QwantMetry)\nTravail sur des notebooks.\n\n30/40 personnes max.","title":"Hands-on - Speaker AWS Marc Cabocel - Deep Dive Sage Maker","toTime":"2019-09-09 17:30","type":"handson"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 16:35","id":"cc-1qcm1ikpoi79jho3lcdi1nflen","room":"Avenir Book","speakers":[{"id":"gmathieu@xebia.fr","name":"gmathieu"}],"summary":"Pitch\n\nDans le cadre de l'intégration des agilistes PS, nous avons fait un expérience où une personne en reconversion de Dev front à Scrum Master a fait la formation SM de 2 jours puis nous l'avons mise dans le grand bain et elle m'a suivi pendant 1 mois en mission au PMU.\nNous ferons la présentation à 2 et nous aborderons la préparation de ce mois en immersion, son ressenti sur cette aventure et si nous pensons qu'il s'agit d'un bon moyen de former des personnes sur le terrain. L'idée est d'éviter certains pièges si ce genre de situation devait se reproduire mais également de vous partager les trucs cool que nous avons vécu.\n\nNiveau\n\ndébutant \n\nPré-requis\n\nN/A","title":"REX - Shadowing Scrum Master PS","toTime":"2019-09-09 17:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 10:05","id":"cc-28rtjqcj52vkbu29p76rq7usmt","room":"Avenir Book","speakers":[{"id":"ldivad@xebia.fr","name":"ldivad"}],"summary":"Répétition en anglais du talk: https://kafka-summit.org/sessions/streaming-apps-poison-pills-handle-unexpected-kafka-streams/\n\n**Pitch** (en français):\nKafka Streams, la librairie de traitement de données en temps réel de Apache Kafka permet de traiter une grande quantité de messages avec de très faibles latences. Les messages peuvent avoir des formats différents, des schémas différents et même être sérialisés de manières différentes. Alors que se passe-t-il quand un message indésirable se retrouve dans un flux ? Ces applications de stream processing ne peuvent pas se permettre d’attendre une remise en route manuelle. Comment notre librairie gère donc ces événements ?\n\n\nCe talk propose d’explorer l’API StreamDSL de Kafka Streams. Des techniques comme les **sentinel values** ou encore les **dead letter queues** y sont proposées. Voyons ensemble comment elles rendent possible la gestion des messages erronés, appelés aussi *poison pills*.\n\n#data\n&nbsp;\n**Niveau** \n&nbsp;\nmoyen\n&nbsp;\n**Pré-requis**\n&nbsp;\nNaN","title":"Live Coding - [EN] Répétition Kafka Summit","toTime":"2019-09-09 11:00","track":"data","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 12:05","id":"cc-5e0a2ulej9b6ghka9g46dsqatu","room":"Avenir Book","speakers":[{"id":"bdepompignan@xebia.fr","name":"bdepompignan"}],"summary":"**Pitch**\nEn 1944 l'OSS, l'ancêtre de la CIA, édite un document expliquant comment les européens peuvent ralentir la progression des Nazies par des actes de sabotage simple.\n\n74 ans après la défaîte des Nazies certaines pratiques semblent toujours perdurer dans nos entreprises !\n\nApprenons ensemble à les détecter et à les éliminer.\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\nAvoir une âme de saboteur","title":"Formal - Répét Xebicon - L'art du sabotage social selon les leçons de la CIA","toTime":"2019-09-09 13:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 11:05","id":"cc-07102pk766ha4dhnckh8q80u62","room":"Avenir Book","speakers":[{"id":"rsagean@xebia.fr","name":"rsagean"}],"summary":"** Pitch : **\nPrésentation de l'API spark metrics. Cette API permet de récupérer des information sur notre jobs et cependant elle est trés peu documenté. Il est également difficile de trouver des exemples de son utilisation. (dernier chapitre de la formation spark develop deploy optimise)\n** Niveau : ** avancé\n** Pré-requis : ** None\n** Logistique : ** videoprojecteur","title":"Formal - Monitoring spark application","toTime":"2019-09-09 12:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 15:05","id":"cc-6e0vtufqs9beaq7kcjbe9nsbde","room":"Avenir Book","speakers":[{"id":"jjublanc@xebia.fr","name":"jjublanc"}],"summary":"**Pitch**\nPrésentation d'algorithmes de deep reinforcement learning et de leur fonctionnement. Deux grandes familles seront présentées : les value optimizer et les policy optimizer.\nUn poil technique pour certaines slides (pas beaucoup), j'ai tout fait pour que ce soit ludique et que tout le monde puisse comprendre les grands mécanismes.\n\n**Niveau**\nDébutant/intermédiaire\n\n**Pré-requis**\nAucun (je pourrai partager les slides sur l'intro au RL avant le XKE)","title":"Formal Reinforcement learning going deep","toTime":"2019-09-09 15:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 14:35","id":"cc-2dduurordln4kerpjt51gpqjce","room":"Avenir Book","speakers":[{"id":"spietrowska@xebia.fr","name":"spietrowska"},{"id":"rmatusiak@xebia.fr","name":"rmatusiak"}],"summary":"La grande majorité des entreprises se lancent avec beaucoup d’effervescence dans de nombreux projets d'innovation Big Data. En parallèle, nous observons de plus en plus de réticence de la part des utilisateurs en tant que source de données. Bien que les origines de ces craintes soient multiples, c'est souvent l'éthique qui est remise en question.\n\nPendant ce talk nous allons parler des principes éthiques du Big Data, de la modélisation éthique et ensuite proposer des pistes de réponses accompagnées de solutions déjà existantes sur le marché.\n\nNiveau : débutant","title":"Formal - L'éthique du Big Data (Xebicon 2019)","toTime":"2019-09-09 15:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 17:35","id":"cc-3gh1evp08r9rhtgt53qlnoae6k","room":"Avenir Book","speakers":[],"title":"Fondation Web","toTime":"2019-09-09 18:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 15:35","id":"cc-5l1gubn4pcg8qk3pmhraakroc1","room":"Avenir Book","speakers":[{"id":"sserdaroglu@xebia.fr","name":"sserdaroglu"}],"summary":"Sujet/problématiques\n\nComment l'informatique pourrait s'inspirer de l'industrie et de son histoire pour continuer de faire évoluer les mentalités et méthodes et concrétiser sur le terrain la mise en oeuvre de stratégies orientées \"organisations data\"?\n\nLes usines 4.0 (opérations 100% automatisées) n'existent pas encore vraiment dans la  vraie vie, mais elles sont là depuis toujours en informatique ; les attentes et besoins en terme d'industrialisation semblent prendre de l'importance ces dernières années, notamment du fait de l'apparition de \"plateformes data\" qui occupent une place toujours plus centrale et critique dans le SI d'une entreprise.\n\nCes plateformes potentiellement ultra-transversales posent des challenges organisationnels plus ou moins nouveaux - peut être le meilleur espoir du début de la fin de l'ère \"fonctionnel/métier\" vs \"technique/DSI\" ?\n\n\nDéroulé : raconter comment je retrouve les problématiques supply chain que j'ai étudié dans les projets studio, et particulièrement les projets estampillés \"data\".\n \nJe reviendrais sur mon vécu, chez Xebia depuis 18 mois et avant, pour vous raconter une histoire qui peut éventuellement inspirer pour faire passer des messages à nos clients.\nL'histoire est une analogie entre un hub numérique type \"datalake\" et les hubs qu'on peut trouver dans le monde physique - dans un contexte industriel bien sûr.","title":"Formal - Data Supply Chain","toTime":"2019-09-09 16:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 15:35","id":"cc-3cke6ujqlg3i3hso4s1k5d9fc5","room":"Avenir Light","speakers":[{"id":"jnorblin@xebia.fr","name":"jnorblin"}],"summary":"**Pitch**\n\nSuper Mario 64 continue de nous dévoiler ses secrets plus de 20 ans après sa sortie. Grâce à une analyse détaillée des mécanismes de jeu, certains joueurs ont pu utiliser de surprenantes découvertes à leur avantage. Comment manipuler la RNG? Comment est gérée la mémoire? Comment les collisions sont-elles détectées? À travers un certain nombre de bugs présents dans le jeu, nous ferons aussi certains parallèles avec le développement logiciel d'aujourd'hui.\n\n**Niveau**\n\nDébutant\n \n**Pré-requis**\n\nAucun","title":"Formal - Super Mario 64 vu par un développeur","toTime":"2019-09-09 16:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 16:35","id":"cc-633anatstefroh3pmkhgiihhub","room":"Avenir Light","speakers":[{"id":"cdreyfus@xebia.fr","name":"cdreyfus"},{"id":"sboeuf@xebia.fr","name":"sboeuf"}],"summary":"## Pitch\n\nRex TF1 - 9 mois de mission et beaucoup + personnes rencontrées = plusieurs conflits humains à gérer. \n\nDans ce slot, nous discuterons de nos différentes expériences interpersonnelles qui se sont, vous allez le voir, plus ou moins bien passées, et de comment nous avons réagi face à celles-ci.\n\n## Niveau\n\ntous niveaux\n\n## Pré-requis\n\nAucun","title":"REX TF1 - Le bon, la brute, et le truand","toTime":"2019-09-09 17:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 14:35","id":"cc-42a9rqehdnkjjvatr3tg4a3k9o","room":"Avenir Light","speakers":[{"id":"csouchon@xebia.fr","name":"csouchon"}],"summary":"**Pitch**\n\nDans les langages de programmation modernes, la gestion de la mémoire est théoriquement \"automatique\". Pourtant, opérer ces systèmes en charge et sur la durée montre clairement que ce côté \"automatique\" est très théorique, et qu'en pratique on doit s'en soucier.\n\nJe vous propose dans ce slot un historique de la mémoire et de sa gestion des origines de l'informatique à nos jours. Le but est de mettre tout cela en perspective dans le cadre des grand modèles mémoires \"automatiques\" d'aujourd'hui (focus sur le comptage de références automatique (ARC) et le Tracing Garbage Collection), quel langage utilise lequel, pourquoi, quel sont les conséquences.\n\nLe but est de sortir de ce slot avec les idées claires sur les différents moyens de gérer la mémoire, et la place de l'OS, du langage et du développeur dans l'équation. Et comprendre les conséquences sur les opérations.\n\n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nAucun","title":"Formal - Histoire de mémoire","toTime":"2019-09-09 15:35","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 10:05","id":"cc-3jab61glrj0k8p93gmqof6qn02","room":"Avenir Light","speakers":[{"id":"omarquet@xebia.fr","name":"Olivier Marquet"},{"id":"abrebant@xebia.fr","name":"abrebant"}],"summary":"**Pitch**\n\n*Roi Loth : \"Quand on veut être sûr de son coup, Seigneur Dagonet… on plante des navets. On ne pratique pas le putsch.\"*\n\n -------------------\n\nSauf que, être sûr de son coup, c'est chaud pépito ! Quand on développe un produit, par où attaquer fonctionnellement ? Comment être sûr une fois la voie empruntée qu'on va dans la bonne direction ?\nL'impact mapping est une réponse possible à ce besoin de naviguer de façon pragmatique dans le fonctionnel en gardant en ligne de mire un impact business, chiffré, de ce qu'on veut accomplir pour notre business !\n\nAlors oui, toi ... Toi qui te marres encore parce que la citation de Kaamelott te rappelle tellement de bons souvenirs, viens dérouler le temps d'un atelier un impact mapping sur un sujet qui te parlera.\n\n-------------------\n\n*Roi Loth : \"Je vous demande de venir, vous venez et puis c’est tout !… Je vais pas non plus aller brûler un cierge sous prétexte que vous avez fait un tour de cheval !\"*\n\n\n**Niveau**\n\nPour tous ! Tech, coach et même trolls seront admis \n\n**Pré-requis**\n\nAucun","title":"Atelier - (Deep) Impact Mapping","toTime":"2019-09-09 12:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 12:05","id":"cc-1lffs0ij20kj6n22sb9sjp2er7","room":"Avenir Light","speakers":[],"summary":"**Pitch**\n \nLe Design Sprint tout le monde en parle, mais en vrai c'est quoi ? \nJe vous partagerai ce que j'ai appris en faisant un design sprint, le tout sous la supervision du concepteur de cette méthode, l'américain J. Knapp. \nCe REX portera sur les principes et les règles du jeu exigés pour le bon fonctionnement du DS. J'essayerai de mettre en évidence les bénéfices apportés par le DS et pourquoi tout profil en agence - du commercial au développeur au product owner au designer - devrait connaître le DS, pour être à même de savoir le conseiller et bien le vendre au cas échéant.\nJe n'hésiterai pas à aborder les idées reçues et les faux mythes qui entourent le Design Sprint.\n \n**Niveau**\n \nDébutant\n \n**Pré-requis**\n \nAucun pré-requis","title":"Formal - Le Design Sprint ou ce que j'ai appris à côté de J. Knapp","toTime":"2019-09-09 12:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 12:35","id":"cc-617d4hcpgsakn92fntf0thl2g0","room":"Avenir Light","speakers":[{"id":"fcussac@xebia.fr","name":"fcussac"}],"summary":"**Pitch**\n\nMonad, Functor, covariance, contravariance, composition, curryfication... Vous avez déjà tenté de rechercher leurs définitions ? Moi oui, et j'ai rien compris. Pourtant j'en fais tous les jours. Et vous aussi peut être, comme l'autre qui faisait de la prose sans le savoir.\n\nJe vous propose un slot en plusieurs parties, où chaque mois nous verrons en 30 minutes un concept de programmation fonctionnelle appliqué en Scala.\n \nDans ce premier épisode, nous démystifierons ensemble le big boss des gros mots en FP, la MONAD !!  \n\n**Niveau**\n\nDébutant (connaitre la syntaxe scala sera un plus pour suivre mais c'est pas nécessaire)\n \n\n**Pré-requis**\nun totbag\nvidéo-projecteur / télé","title":"Live coding - Scala - FP et ses gros mots. Episode 1, les monads","toTime":"2019-09-09 13:00","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 17:35","id":"cc-6itekjepjnkdf68bk1a1qnsunv","room":"Avenir Light","speakers":[{"id":"achotard@xebia.fr","name":"achotard"}],"summary":"**Pitch**\nCe slot est le lancement du début du \"mentoring\" sur les Conteneurs : la Container ~Summer~ School.\nLes participants sont déjà connus et ce slot est la première occurence d'une session hebdomadaire de formation conteneurs interne. Pour plus d'infos, voir le mail \"Container (Summer ?) School\". Si vous souhaitez venir, la porte sera ouverte, mais attendez vous à n'avoir que  le début théorique d'un mentoring qui s'étalera sur quelques mois !\n\n**Niveau**\nDébutant/intermédiaire\n\n**Pré-requis**\nFaire partie des participants à la Container ~~Summer~~ School ou accepter de venir en observateur et de râter la suite :)","title":"Container ~Summer~ School","toTime":"2019-09-09 18:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 12:05","id":"cc-6nat8a2i0k2dik4r95acgl90pk","room":"Avenir Roman","speakers":[{"id":"akinsella@xebia.fr","name":"Alexis Kinsella"}],"summary":"Tout développeur qui s'est déjà intéressé à la Data Science connaît TensorFlow, la coqueluche des framework de Machine Learning. Toutefois un framework ne fait pas tout, et Google a développé pour ses besoins internes TensorFlow Extended (TXF) qui a pour objectif de faciliter l'opérationalisation de modèles de Machine Learning, en se focalisant en particulier sur sa capacité à déployer des applications ML en production, gérer des Datasets importants, entraîner et servir des modèles avec consistence et gérer correctement le versionning des modèles pour l'inférence.\n\nNous décrypterons en particuliers les fonctionnements de TensorFlow Extended reposant sur des libraries et composants portant des noms barbares tels que TFDV, TFT, TFMA, ou encore MLMD, puis nous verrons comment les pipelines ML de TFX s'intègrent avec les orchestrateurs de notre quotidien.\n\nEnfin, nous découvrons comment nous pouvons mettre en oeuvre des techniques avancées de déploiement et de gestion de modèles en production.","title":"Apprendre à utiliser TensorFlow Extended (TFX) pour déployer et gérer efficacement vos pipelines ML jusqu'en production","toTime":"2019-09-09 12:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 15:35","id":"cc-5gbb4pggglodnh74foser67ugl","room":"Avenir Roman","speakers":[{"id":"lseng@xebia.fr","name":"lseng"},{"id":"achaabani@xebia.fr","name":"achaabani"}],"summary":"**Pitch**\n \nL'Extreme Carpaccio est un jeu d'équipe qui réunit les talents des product owners et des développeurs dans un challenge où l'équipe gagnante est celle qui a le mieux découpé, priorisé et délivré de la valeur au plus tôt.\n\nCe coding game est inspiré des ateliers Elephant Carpaccio et Extreme Startup. Il se joue en équipe de 2/3 personnes avec au moins 1 développeur par équipe. **Ouvert aux profils non techniques.**\n\nEtes-vous prêt à relever le défi et vous mesurer aux autres équipes ?\n \n**Niveau**\n \ndébutant / moyen\n \n**Pré-requis**\n\nChaque équipe doit être constitué d'au moins 1 développeur et muni d'1 ordinateur portable connecté au réseau local\n \n**Logistique**\n\nDes tables, des chaises ! :-)","title":"Contest - Venez relever le défi de l'Extreme Carpaccio","toTime":"2019-09-09 17:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 11:05","id":"cc-2ff4v7bsdev6rfcdn7vqgikro4","room":"Avenir Roman","speakers":[{"id":"pguzman@xebia.fr","name":"pguzman"}],"summary":"**Pitch**\nSwift 5.1 sera bientôt disponible avec beaucoup de nouveautés. \nDans ce Hand-on on apprendra ce qui change pour les développeurs Swift.\nPlus précisément, on parlera de Opaque return types.\n\n**Niveau**\n\ndébutant Swift- intermédiaire\n \n**Pré-requis**\n projecteur\nInstaller Xcode","title":"Hands-on - From existential to opaque return types","toTime":"2019-09-09 12:00","type":"handson"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 17:35","id":"cc-2ntfgp5tba61fqs027pluifsfb","room":"Avenir Roman","speakers":[{"id":"ybenoit@xebia.fr","name":"Yoann Benoit"}],"title":"Fondation data","toTime":"2019-09-09 18:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 14:35","id":"cc-2iirngaosbgverb69606df2g8s","room":"Avenir Roman","speakers":[],"summary":"**Pitch**\n\nA tous ceux qui pensent qu'il n'y a qu'une manière d'implémenter un plan de marquage et que les Consultants Analytics ne pourront jamais être les meilleurs amis des Devs, préparez-vous à rester bouche bée.\n\nAu programme : des petits REX d'implémentation de TMS / Outil d'Analytics un peu hors normes, en terminant par un échange participatif pour imaginer l'implémentation de demain.\n\n**Niveau**\n\nDébutant / Moyen\n\n**Pré-requis**\n\nAucun\n\n**Matériel**\n\nVidéo-projecteur","title":"Formal / REX : 50 shades of Analytics","toTime":"2019-09-09 15:30","type":"talk"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 13:05","id":"cc-5cel1og9bun1pn63qln7aksql4","kind":"keynote","room":"Salle Design Thinking, 4e","speakers":[],"summary":"\n7 pièces par personnes parmi : mini burger, mini wrap, mini club sandwich.\n1 dessert.","title":"Déjeuner","toTime":"2019-09-09 14:05","type":"lunch"},{"conferenceId":"cc-20190909","fromTime":"2019-09-09 17:35","id":"cc-6mt35vnpc0gu9v3thm6598jt5u","room":"À définir","speakers":[],"title":"After XKE et partage","toTime":"2019-09-09 20:00","type":"talk"}]