[{"conferenceId":"cc-20190701","fromTime":"2019-07-01 09:00","id":"cc-04n83t9k3ebrudkbdqlskg4h42","kind":"keynote","speakers":[],"title":"Petit déjeuner","toTime":"2019-07-01 09:30","type":"lunch"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 09:30","id":"cc-2351mf9h53uta61okuib2qqkav","kind":"keynote","speakers":[],"title":"Plénière - Présentation de Marcel","toTime":"2019-07-01 10:00","type":"keynote"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 10:00","id":"cc-5kit6lksqq08fkas2j28iuj7hv","kind":"keynote","speakers":[],"title":"Plénière - Notre approche DBT","toTime":"2019-07-01 11:00","type":"keynote"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 11:00","id":"cc-70r34dj4chj34b9gcgojcb9kc5i66bb16ks3ab9ic8r3gd9g65ij0p316k","kind":"keynote","speakers":[],"title":"Pause","toTime":"2019-07-01 11:30","type":"break"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 11:30","id":"cc-010lu00tl0hgril5qiuuogu68u","speakers":[],"summary":"Pitch\nOrange, c'est 151000 collaborateurs dans le Monde. Et un rapport aux \"ressources humaines\" qui a parfois été dramatique. Mais depuis janvier 2018, Orange France a lancé la plus grande transformation agile à l'échelle en France, actuellement.\n\nL'équipe de transformation Orange France nous a reçus le 27 juin pour nous dire pourquoi, comment, avec qui.\nOn vous débriefe ?\n\nNiveau\ndébutant\n\nPré-requis\nBonne humeur et pas (trop) de SAFe-Bashing :)","title":"Learning Expedition : La révolution Orange","toTime":"2019-07-01 12:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 11:30","id":"cc-05p1jl4o020jvpgbkbaqgr9g11","speakers":[],"summary":"Keycloak\n**Pitch**\n\nUn client vous assure déjà demandé de faire un formulaire d'identification? De la gestion de droit utilisateur ?\nVous avez l'impression de coder toujours les mêmes user story?\n\nCe talk est pour vous. Venez découvrir l'univers des IAM.\n\nTable done right\n** Pitch: ** On revoit les bases de la dataviz avec le tableau.\n** Niveau: ** Débutant\n** Pré Requis: **","title":"Lightning Talks","toTime":"2019-07-01 12:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 11:30","id":"cc-1qjbffinj9uq7gq1v4sglt2etc","speakers":[],"summary":"Vous aimez les jeux de sociétés? Vous appréciez les jeux de rôle? vous êtes passionnés par votre métier? \n\nNous vous proposons une adaptation de la vie d'un projet informatique en jeu de rôle 1D20 (pour les connoisseurs).\nLe slot commencera par une présentation des règles du jeu avant de lancer un session de jeu sur plusieurs tables avec plusieurs MJ.\n\nAu cours de la session de jeu, vous incarnerez un développeur dans un projet informatique. A vous de choisir si vous jouerez un architecte, un gourou du craftsmanship, un data engineer ou un expert du web.\nComme dans tout bon jeu de rôle, il n'est pas nécessaire de savoir lancer des boules de feu pour jouer un magicien. Ce jeu est donc accessible à tous le monde (Technique, RH, Marketting, Commerce, ...).","title":"Présentation du PS-RPG et session de jeu","toTime":"2019-07-01 13:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 11:30","id":"cc-2eqn7tio069bt5h3pbs77e6uih","speakers":[],"summary":"**Pitch**\n \nFlutter est un outil apporté par Google pour créer des applications iOS, Android et même web avec la même base de code (Dart).\n\nCe codelabs reprend dans les grandes lignes les codelabs de Google https://flutter.dev/docs/codelabs sur le sujet.\n\nNous proposons une présentation de Flutter ~15 min puis une mise en pratique à travers un Hands'On accompagné.\n\nÀ la fin de la session nous espérons vous avoir transmis les clés pour développer une application comme des grands !\n \n**Niveau**\n \nDébutant\n \n**Pré-requis**\n \nInstaller Android Studio\nInstaller Flutter","title":"Codelabs Flutter","toTime":"2019-07-01 13:00","type":"handson"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 11:30","id":"cc-6sg4htemtc2jiea34sutqj42ri","speakers":[],"summary":"La psychologie cognitive est un élément essentiel pour comprendre réellement les attentes utilisateurs et dépasser les premiers éléments de reponses biasés lors des tests.\n\nPauline Girardey","title":"Le user test au coeur des programmes de transformation","toTime":"2019-07-01 12:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 12:00","id":"cc-394ra023terpcioi890695pqs9","speakers":[],"summary":"Les serveurs de développement, c'est souvent une zone de non droit. Chacun n'en fait qu'à sa tête, utilise toutes les ressources dès qu'il le peut, et comme jamais personne ne fait le ménage, on se tape régulièrement un problème d'espace disque. Et c'est encore plus pénible quand les développeurs n'ont aucun accès root pour régler eux même leurs problèmes.\nLe pompom, c'est quand un client a toute son infrastructure hébergé directement chez lui et qu'internet tombe en panne. Alors là c'est foutu, vous êtes sur de passer une journée de merde. Bye votre CI, bye vos tests sur la dev... PLUS RIEN NE MARCHE.\n\nN'y a-t-il vraiment aucune solution pour prévenir ces problèmes ? Sommes-nous les esclaves d'un service d'opérationnels basé dans des bureaux à l'autre bout de la France, injoignable par des voies autre qu'un ticket jira ?\n Spoiler alert, non. Et c'est ce que nous verrons ensemble.\n \n**Niveau**\ndébutant\n \n**Pré-requis**\n projecteur","title":"live coding - s'émanciper de l'environnement de dev' avec Ansible et Docker","toTime":"2019-07-01 13:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 12:00","id":"cc-3f4qqr9g82jnn4nf7289l08l3b","speakers":[],"summary":"Pourquoi le langage Julia a-t-il été créé ? Quels sont ses avantages et ses inconvénients ? Au cours de ce slot nous verrons les bases de Julia dans le contexte du machine learning et répondrons à la question dans le titre :-) Suspense !\n\n\nNiveau : débutant\nPré-requis : si vous souhaitez participer dans le hands-on, les pré-requis sont ici : https://github.com/sanpie90/julia\nLogistique : vidéo-projecteur","title":"Formal + Hands-on - \"Julia - est-ce la fin du Python ?\"","toTime":"2019-07-01 13:00","type":"handson"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 12:00","id":"cc-5sl62nngti28iu0bl3eu2kjs2g","speakers":[],"summary":"**Pitch**\n \nAgile ou pas, la réussite d'un projet ou d'un transformation tient en grande partie à la façon dont les personnes impactées réagissent au changement. \nJe partagerai pendant ce slot mon expérience d'une vie passée sur un projet de transformation d'organisation et de process (création de centre de service partagés) avec un focus sur la gestion du changement.\n \n**Niveau**\n \nDébutant \n \n**Pré-requis**\n \nAucun","title":"Change My Pitch Up","toTime":"2019-07-01 13:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 13:05","id":"cc-7lblh5kmg754nmvvd7q0tp6ebp","kind":"keynote","speakers":[],"title":"Déjeuner","toTime":"2019-07-01 14:00","type":"lunch"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 14:00","id":"cc-232h2gd92mt656egd6eb2ktqjq","kind":"keynote","speakers":[],"summary":"1 - Patricio\n2 - Richard\n3 - Rami\n4 - Elhadi Cherifi\n5 - Fayçal","title":"New comers","toTime":"2019-07-01 14:25","type":"keynote"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 14:30","id":"cc-30dvu942qhrfbb0sjush0ttrpd","speakers":[],"summary":"**Pitch**\n\nEtes-vous prêt à relever le défi et vous mesurer à d'autres Agilistes sur leur propre terrain ? Venez tester votre connaissance de Scrum avec un questionnaire spécialement concocté pour préparer la certification de Scrum.org PSM 1.\n \n\n**Niveau**\n\nintermédiaire\n \n\n**Pré-requis**\n\nLecture du Scrum Guide","title":"Contest - Are you ready ? Certif PSM1","toTime":"2019-07-01 15:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 14:30","id":"cc-3q69bqntprj63haf0okh3i5qvq","speakers":[],"summary":"**Pitch**\n\nOn entend beaucoup parler de Quarkus ces dernier temps. Mais à quoi sert réellement ce nouveau framework Java et comment fonctionne-t-il ?\n\n**Niveau**\n\ndébutant à moyen \n\n**Pré-requis**\n\nPas de prérequis","title":"Quarkus","toTime":"2019-07-01 15:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 14:30","id":"cc-40ur61dooggmi1q88fso05ttse","speakers":[],"summary":"## Pitch\n\nLa data est un monde abstrait, difficile à se représenter, avec pléthore d'outils. Notre solution : proposer un portail pour regrouper tous ces outils et ainsi fournir une vision globale...\n\nPourquoi en sommes-nous venus à créer un portail \"boîte à outils\"? Quels sont les métiers utilisateurs du portail? Comment la collaboration des équipes a-t-elle été impactée? Quelles sont les technos choisies?\n\nCe portail est principalement destiné aux :\n- data ingénieurs /devops : des outils pour **superviser** et suivre l'exploitation\n- data scientists/business analysts/PO : des outils de restitution de la donnée, de **data lineage**\n- gouverneur/métiers financiers : des outils de **maîtrise des budgets**\n\n**Le portail, c'est le visage de notre Data Lake.**\n\n## Niveau\n\nDébutant, ouvert à tous\n\n## Pré-requis\n\nPas filmé","title":"ZePortal : un portail d'accès à notre datalake, pour tous!","toTime":"2019-07-01 15:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 14:30","id":"cc-48pn6t7cdffn97c61pm8g1dur5","speakers":[],"summary":"Pitch:\nSpinnaker est une plateforme de déploiement continue développé par Netflix. \n\nNiveau: débutant\nPré-requis: video projecteur","title":"Spinnaker","toTime":"2019-07-01 15:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 14:30","id":"cc-7h3ug6i8tcovtaeo3nstvequ31","speakers":[],"summary":"**Pitch**\n \nCompilation de mon retour d'expérience des choix techniques Front sur un projet BackOffice from scratch pour Paylib.\n\nDans cette session vous allez voir comment une expérience significative sur le framework Angular m'a influencé durant le démarrage de ce nouveau projet React. \n\nJe vais parler Architecture Front, TypeScript, State Management, RxJS et pas mal de librairies React.\n\nAvec un recul de 6 mois, venez savoir mon jugement à froid si je pense que mon choix de démarrage était une bonne ou mauvaise idée.\n \n**Niveau**\n \ndébutant\n \n**Pré-requis**\n projecteur","title":"REX - Front BackOffice Paylib","toTime":"2019-07-01 15:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 15:30","id":"cc-3jfku4tujb054uu3hea1dluj0q","speakers":[],"summary":"**Pitch**\n\nPrise en main et tous les cas utiles dans une application Web ou dans un micro-service. Après ça, vous abandonnerez les annotations...\n\n**Niveau**\n\nConnaître un peu Scala\n\n**Prérequis**\n\n - Intellij avec plugin Scala ou autre IDE qui gère Scala 2.12\n - sbt (à installer selon un des moyens fourni par https://www.scala-sbt.org/download.html)\n - TODO : repo, sbt update, etc...","title":" Hands on Play JSON","toTime":"2019-07-01 17:30","type":"handson"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 15:30","id":"cc-4lbs20lof661fkp2d08041sg09","speakers":[],"summary":"**Pitch**\n\nSI il y a bien quelque chose d'ennuyeux lorsque l'on code, c'est de ré-écrire toujours le même code. Par exemple si je veux transformer 10 classes Scala ou Java en Json, il va falloir que j'écrive 10 fois comment les convertir.\n\nEn réalité, on ne fait pas ça, et on se sert d'outils utilisant la réflexion pour générer les convertisseurs pour nous.\n\nC'est un outil puissant mais dangereux : Tout se passe à l’exécution !\n\nEt si il était possible de faire la même chose à la compilation pour bénéficier de la sureté du compilateur ?\n\nVenez découvrir Shapeless, une bibliothèque Scala qui fait de la magie noire :)\n \n**Niveau**\n \nintermédiaire\n \n**Pré-requis**\n projecteur","title":"Shapeless","toTime":"2019-07-01 16:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 15:30","id":"cc-4v6rmfltsn67q4rdnc9f8u919b","speakers":[],"summary":"**Pitch**\n \nPrésentation des auto-encodeurs et de leurs cousins les variational autoencoders. \nConstruire son propre auto-encodeur, et son propre VAE.\n \n**Niveau**\n \nMoyen \n \n**Pré-requis**\n \nGit à cloner OU Google Colab","title":"Formal & Live Coding - Manipuler des auto-encodeurs","toTime":"2019-07-01 17:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 15:30","id":"cc-7appm4tkobiejf8cv6ne1pq4re","speakers":[],"summary":"### Pitch\n\nPlus qu'un mot hype, les design systems constituent une réelle évolution dans la conception UI/UX des projets. Cela dit, une méthodologie ne constitue pas une garantie de qualité. Et pour preuve, nombre de projets ayant investi dans l'élaboration d'un design system finissent par livrer un produit en décalage avec la vision initiale des designers.\n\nNous essaierons ici de lister les sources potentielles de ces décalages, et d'y proposer une solution \n\n### Niveau\n\ndébutant\n\n### Pré-requis\n\nAucun","title":"Design Systems - Les pain points","toTime":"2019-07-01 16:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 16:30","id":"cc-1c4muiqgaqoui75b8gvpmjg0r1","speakers":[],"summary":"**Pitch**\n\nVenez découvrir le framework d'agilité a l'echelle de la Scrum Alliance: Scrum@Scale\n\n**Niveau**\n\ndébutant\n\n**Pré-requis**\n\naucun","title":"Scrum@Scale","toTime":"2019-07-01 17:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 16:30","id":"cc-2q1lobj3smumajoafokqom3a2b","speakers":[],"summary":"**Pitch**\n \nVenez contribuer à la constitution d'un mapping de toutes les expertises de Xebia, qui servira pour s'auto-évaluer, gérer la montée en compétence ou le changement d'expertise, mais aussi pourquoi pas comme outil open source à l'extérieur.\n \n**Niveau**\n \nÊtre expert dans son domaine (être un Xebian quoi ^^)\nToutes les expertises sont les bienvenues et nécessaires\n \n**Pré-requis**\n \nAucun","title":"Debate + Group Work - Construction d'une map d'expertise","toTime":"2019-07-01 17:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 16:30","id":"cc-5pgtu666c0hv4l9bj26mtqtb4m","speakers":[],"summary":"**Pitch**\nL'attractivité en terme économique et time to market des services managés du cloud ne sont plus à présenter. En particulier, les applications serverless s'appuient fortement sur ces derniers. Et cela bouleverse totalement notre manière de concevoir nos applications !\n\nContre les grandes catastrophes, nous proposons de mettre en oeuvre les grands moyens ! Plutôt que de nous limiter à une simple présentation, nous cadrerons un atelier de réflexion collective par petits groupes afin de favoriser les échanges  et l'émergence d'une solution idéale.\n\nDurant l'atelier, vous serez amené à réfléchir, à échanger et à débattre sur un morceau d'architecture pour essayer de trouver une voie d'optimisation, que nous comparerons, les unes avec les autres, puis avec notre propre proposition.\n\nNous prendrons un cas concret, celui de notre client, comme base de travail.\n \n**Niveau**\nmoyen\n \n**Pré-requis**\nAucun pré-requis","title":"Formal + Hands-On - Serverless architecture done right ?","toTime":"2019-07-01 17:30","type":"handson"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 17:30","id":"cc-1du41e2j6q5o8a2ha6hmgfonbj","speakers":[],"title":"Démo XebiKart","toTime":"2019-07-01 18:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 17:30","id":"cc-1s95cbutg7944camemunp484cd","speakers":[],"summary":"**Pitch**\n\nVous avez entendu parler du Coral  ? Annoncé pendant la Google I/O, Coral est la nouvelle plateforme pour faire tourner l'intelligence artificielle sur les devices edge. Snips a opensourcé récemment le lib Tract (https://github.com/snipsco/tract), un moteur d'inférence très léger écrit en Rust. Quel est l'état de l'art sur les différente technologies ? Venez découvrir :)","title":"Edge Computing: State of the art","toTime":"2019-07-01 18:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 17:30","id":"cc-5vvnlg020gc1h1v0cuv5d115fj","speakers":[],"summary":"Si la transformation digitale est souvent prise sous le prisme des enjeux technologiques et d'organisation, sont succès réside dans l'intégration et la compréhension de la marque et de la raison d'être afin de créer réellement des expériences spécifiques et pas que des mee too.\n\nMarie Nossereau","title":"Le role de la marque dans la transformation digitale","toTime":"2019-07-01 18:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 17:30","id":"cc-6m1f7uusp86i7g2mmcg55vh1uv","speakers":[],"summary":"**Pitch**\n\nIl y a un bon moment, nous lancions XDD (Xebia Data Driven) avec comme objectif de centraliser et exposer les données de tout ce qu'on fait chez Xebia. Aujourd'hui, nous avons des APIs exposant les informations sur les Xebians, les XKE, les Échos des TOs, les Mardi En Terre Inconnue, et des débuts sur les Vidéos et les articles de blog.\n\nC'est cool d'avoir des APIs, encore faut-il les utiliser ! Changeons un peu des front-end habituels : les graphes c'est cools, mais notre bon vieux terminal aussi :) Ce slot traitera donc de `xebia-cli`, un outil en CLI pour interagir avec XDD (et peut-être plus ?). En 30min, nous parlerons de pourquoi j'ai choisi Rust pour un tel projet, de comment je m'en sers, des choses cools et écueils rencontrés jusqu'ici, et de pourquoi c'est marrant à développer.\n \n**Niveau**\n \nBeginner\n \n**Pré-requis**\n\nAucun","title":"Xebia-CLI, le début d'une (longue ?) histoire","toTime":"2019-07-01 18:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 18:00","id":"cc-379taqe4ed29eak1q771hocq3o","speakers":[],"title":"Avancement des plans d’actions Vision Agilistes","toTime":"2019-07-01 19:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 18:00","id":"cc-5nq3u1d4uu2mhg5m6foea4idh6","speakers":[],"title":"Fondation Data","toTime":"2019-07-01 19:00","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 15:30","id":"cc-0pk7c76sur88eolh2vr4mq7kl3","room":"6e - Xebia","speakers":[],"summary":"**Pitch**\n \nBasé sur le jeu \"Beer Game\", serious game permettant de toucher du doigt la systémique, je vous propose d'itérer sur ce jeu sur une version dématérialisée.\nL'ambition est de discuter système, mesures du système, amélioration locale/globale et engagement... \n \n**Niveau**\n \ndébutant\n \n**Pré-requis**\n \nLe jeu fonctionne par multiple de 4...\nChaque participant doit être équipé d'un laptop connecté.\n\nContrainte : 16 participants maximum avec chacun son laptop connecté","title":"Serious Game Systématique et mesure. Beergame Itératif","toTime":"2019-07-01 17:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 15:30","id":"cc-78uqi66mqemmbvdu3ntim8uvqi","room":"Auditorium","speakers":[],"summary":"**Pitch**\n\nPas toujours simple de faire le bon choix chez un cloud provider. Sur Google Cloud plusieurs solutions s’offrent à nous. Dois je faire une Fonction ou déployer sur une machine virtuelle ? Quelles autres options sont disponibles ? Quelles sont les fonctionnalités mise à disposition ?\nJe vous propose d’explorer les 5 voies possibles pour créer une application Web sur Google cloud. \n\n**Niveau**\n\ndébutant\n\n**Pré-requis**\n\nAucun","title":"Formal+ Démo - Mon application Web sur Google cloud, les 5 voies","toTime":"2019-07-01 16:30","type":"talk"},{"conferenceId":"cc-20190701","fromTime":"2019-07-01 16:30","id":"cc-60m9hga42njg86bnoh0f60ppmc","room":"Auditorium","speakers":[],"summary":"Cannes n'est pas qu'un festival de cinéma, c'est aujourd'hui le plus grand évènement qui célèbre la création publicitaire. Et à cette occasion nous voulions partager les meilleurs cas où la technologie et la data sont au service de la créativité.\n\nJean Baptisite Burdin / Natacha Hannothiaux","title":"Back to Cannes, le meilleure de la création publicitaire","toTime":"2019-07-01 17:30","type":"talk"}]